[
    {
        "id": 1,
        "code": "ma-203",
        "title": "engineering mathematics-iii",
        "credits": [4,3,1,0],
        "units": [
            {
                "id": 1,
                "title": "Functions of Complex Variable",
                "topics": "Applications of De Moivre’s theorem, Exponential, Circular, Hyperbolic and Logarithmic functions of a complex variable, Inverse Hyperbolic functions, Real and imaginary parts of Circular and Hyperbolic functions, Summation of the series-‘C+iS’ method. Limit and derivative of complex functions, Cauchy-Riemann equations, Analytic functions and its applications, Complex integration, Cauchy’s theorem, Cauchy’s integral formula, Series of complex function, Taylor series, singularities and Laurent’s series, Cauchy’s residue theorem and its application for the evaluation of real definite integrals"
            },
            {
                "id": 2,
                "title": "interpolation",
                "topics": "Least square curve fit and trigonometric approximations, Finite differences and difference operators, Newton’s interpolation formulae, Gauss forward and backward formulae, Sterling and Bessel's formulae, Lagrange's interpolation"
            },
            {
                "id": 3,
                "title": "Numerical Integration",
                "topics": "Integration by trapezoidal and Simpson’s rules 1/3 and 3/8 rule, Romberg integration, and Gaussian quadrature rule, Numerical integration of function of two variables"
            },
            {
                "id": 4,
                "title": "Numerical Solution of Ordinary Differential Equations",
                "topics": "Taylor series method, Picard’s method, Euler’s method, Modified Euler’s method, Runge‐Kutta method, Predictor corrector methods, Adam Bashforth and Milne’s method, convergence criteria, Finite difference method"
            },
            {
                "id": 5,
                "title": "Numerical Solution of Linear and Non Linear Equations",
                "topics": "Non Linear Equations: Bisection Method, Regula Falsi Method, Newton-Raphson Method, Iteration method, Linear Equations: Jacobi and Gauss Seidal Iteration methods, Relaxation method"
            },
            {
                "id": 0,
                "title": "Books",
                "topics": "Complex variables and Applications: by R. V. Churchill, T. J. Brown & R. F. Verhey, McGraw Hill._A first course in complex analysis with applications: by Dennis D. Zill & P. D. Shanahan Jones and Bartlett._Numerical Methods for Scientific and Engineering Computations: by M. K. Jain, S. R. K. Iyenger and R. K. Jain, New Age International Publishers, New Delhi_Numerical Methods for Engineers and Scientists (2nd Ed.): by J. D. Hoffman, CRC Press._Numerical Analysis Mathematics and Scientific computing (3rd ed.): by D. Kincaid and W. Cheney, American Mathematical Society"
            }
        ]
    },
    {
        "id": 2,
        "code": "ec-221",
        "title": "linear integrated circuits (LIC)",
        "credits": [4,3,1,0],
        "units": [
            {
                "id": 1,
                "title": "Differential And Cascode Amplifiers",
                "topics": "Emitter coupled differential amplifiers & its circuit configurations, FET differential amplifier, Differential amplifier with swamping resistor, constant current bias & current mirror. Cascade differential amplifier stages. Level translator, Cascode configuration"
            },
            {
                "id": 2,
                "title": "Introduction to Operational Amplifiers",
                "topics": "The basic operational amplifier & its schematic symbol, Block diagram representation of OP-AMP, Power supply requirements of an OP-AMP, Evolution of OP-AMP, Specification of a typical OP-AMP(741)"
            },
            {
                "id": 3,
                "title": "The Practical Op-Amp And Its Frequency Response",
                "topics": "Input offset voltage, input bias current, input offset current. Total output offset voltage, thermal drift, error voltage, variation of OP-AMP parameter with temperature & supply voltage. Supply voltage rejection ration (SVRR), CMRR-Measurement of OP-AMP parameters, Frequency response of compensator networks, Open loop voltage gain as a function of frequency, Slew rate, causes of slew rates and its effects in application"
            },
            {
                "id": 4,
                "title": "Operational Amplifier Configurations & Linear Application",
                "topics": "Open loop OP-AMP configurations- The differential amplifier, inverting amplifier, non-inverting amplifier, negative feedback configurations - inverting and non-inverting amplifiers, voltage followers & high input impedance configuration, differential amplifiers, closed loop frequency response & circuit stability, single supply operation of OP-AMP, summing, scaling and averaging amplifier, voltage to current & current to voltage converters, integrators & differentiators, logarithmic & anti logarithmic amplifiers"
            },
            {
                "id": 5,
                "title": "Active Filters & Oscillators",
                "topics": "Advantages of active filters, classification of filters, response characteristics of butter worth, chebyshev, causal filters, first order and second order butter worth filters- low pass and high pass types. Band pass & band reject filters. Oscillator principles, types of oscillators - phase shift, Wien Bridge & quadrature. Square wave, triangular wave and saw tooth wave generators, voltage controlled oscillator"
            },
            {
                "id": 6,
                "title": "Comparators & Converters",
                "topics": "Basic comparator & its characteristics, zero crossing detector, voltage limiters, clippers & clampers, small signal half wave & full wave rectifiers, sample and hold circuit, ADC, DAC"
            },
            {
                "id": 7,
                "title": "Voltage Regulators",
                "topics": "Fixed Voltage Regulator, Adjustable voltage regulators, Switching regulators, special regulators"
            },
            {
                "id": 0,
                "title":"Books",
                "topics": "OP-AMP and Linear Integrated Circuits Ramakant A Gayakwad PHI Publication._Design with Operation Amplifiers and Analog Integrated circuits Sergei Franco TMH._Integrated Electronics: Analog and Digital Circuits & System Millman & Halkias TMH._Linear Integrated Circuits D Choudhari S Jain New Age International limited"
            }
        ]
    },
    {
        "id": 3,
        "code": "ec-222",
        "title": "analog communication systems",
        "credits": [4,3,1,0],
        "units": [
            {
                "id": 1,
                "title": "Modulation Techniques",
                "topics": "Various Frequency Bands Used for Communication, Types of Communication and Need of Modulation. Introduction to AM, FM, PM, Frequency Spectrum of AM Waves, Representation of AM, Power Relation in AM Waves, Need and Description of SSB, Suppression of Carrier, Suppression of Unwanted Side-bands, Independent Sideband System, Vestigial Sideband System, Mathematical Representation of FM, Frequency Spectrum of AM Waves, Phase Modulation, Comparison Between Analog and Digital Modulation, Wideband and Narrow Band FM"
            },
            {
                "id": 2,
                "title": "AM Transmitters and Receivers ",
                "topics": "AM Transmitters: Generation of AM, Low Level and High Level Modulation, AM Transmitter Block Diagram, Collector Class C Modulator, Base Modulator, Transistor Vander Bill Modulator, DSB S/C Modulator. AM Receiver: Tuned Radio Frequency (TRF) Receiver. Super Heterodyne Receiver, RF Section and Characteristics, Mixers, Frequency Changing and Tracking, IF Rejection and IF Amplifiers. Detection and Automatic Gain Control (AGC), AM Receiver Characteristics"
            },
            {
                "id": 3,
                "title": "FM Transmitters and Receivers ",
                "topics": "FM Transmitters: Basic Requirements and Generation of FM, FM Modulation Methods: Direct Methods, Variable Capacitor Modulator, Varactor Diode Modulator, FET Reactance Modulator, Transistor Reactance Modulator, Pre-emphasis, Direct FM Modulator, AFC in Reactance Modulator, Disadvantages of Direct Method, Indirect Modulators, RC Phase Shift Modulators, Armstrong FM Systems. FM Receivers: Limiters, Single and Double-Tuned Demodulators, Balanced Slope Detector, Foster-Seeley or Phase Discriminator, De-emphasis, Ratio Detector, Block Diagram of FM Receivers, RF Amplifiers, FM Receiver Characteristics"
            },
            {
                "id": 4,
                "title": "SSB Transmitters and Receivers ",
                "topics": "Generator of SSB, Balanced Modulator Circuit, Filter Method, Phase Shift Method, Third Method, Phase Cancellation Method, Demodulation of SSB, Product Demodulator, Diode Detection Technique of SSB"
            },
            {
                "id": 5,
                "title": "Pulse Modulation Techniques ",
                "topics": "Pulse Amplitude Modulation and Demodulation, Pulse Width Modulation and Demodulation, Pulse Position Modulation and Demodulation, Sampling Theorem, Time Division Multiplexing, Frequency Division Multiplexing"
            },
            {
                "id": 0,
                "title": "Books",
                "topics": "Electronic communication Systems by G. Kennedy, McGraw-Hill Education Publisher._Principals of Communication System by Taub & Schilling, McGraw-Hill Education Publisher._Electronic communication Systems by S. Haykin, Wiley India Pvt. Limited Publisher. "
            }
        ]
    },
    {
        "id": 4,
        "code": "ec-212",
        "title": "analog electronics",
        "credits": [4,3,1,0],
        "units": [
            {
                "id": 1,
                "title": "Low Frequency Transistor Amplifier",
                "topics": "Equivalent Circuit of BJT using h-parameter for CB, CE and CC & configuration, Calculation of Transistor Parameter for CB, CE & CC using hparameters, Comparison of Transistor Amplifier Configuration"
            },
            {
                "id": 2,
                "title": "Multistage Amplifier",
                "topics": "General Cascaded System, RC Coupled Amplifier and its Frequency Response, Merits and Demerits, Cascade Amplifier, Darlington Compound Configuration, Multistage Frequency Effect "
            },
            {
                "id": 3,
                "title": "High Frequency Response of Transistor Amplifier",
                "topics": "High Frequency Model for CE Configuration, Approximate CE High Frequency Model with Resistive Load, CE Short Circuit Current Gain, HF Current Gain with Resistive Load "
            },
            {
                "id": 4,
                "title": "Large Signal Amplifier",
                "topics": "Analysis and Design of class A, B, AB, C Amplifiers, Push-pull Amplifiers, Transformer Less Output Stages, Distortion Calculations "
            },
            {
                "id": 5,
                "title": "Tuned Amplifier",
                "topics": "General Behavior of Tuned Amplifiers, Series and Parallel Resonant Circuit, Calculations of Circuit Impedance at Resonance, Variation of Impedance with Frequency, Q Factor of a Circuit & Coil, Bandwidth of Series and Parallel Resonant Circuit, Single Tuned Amplifiers, Voltage Gain and Frequency Response of Single Tuned Amplifiers, Double Tuned Amplifiers "
            },
            {
                "id": 6,
                "title": "Feedback Amplifier",
                "topics": "Feedback concept, Characteristics of Negative and Positive Feedback, Effect of Negative and Positive Feedback on Input Impedance, Output Impedance, Gain, Noise and Frequency Response "
            },
            {
                "id": 7,
                "title": "Oscillators",
                "topics": "Classification of Oscillators, Frequency Stability of Oscillatory Circuits, Tuned based Oscillators, Hartley Oscillator, Colpitt Oscillators, Clapp Oscillator, Crystal Oscillator, Phase Shift Oscillator and Wien Bridge Oscillator "
            },
            {
                "id": 0,
                "title": "Books",
                "topics": "Integrated Electronics: Analog and Digital Circuits and Systems by J. Millman and C. Halkias, McGraw-Hill, Inc._Electronic Devices & Circuit Theory by R. Boylestad and L. Nashelsky, Pearson._Microelectronic Circuits by A. Sedra and K. Smith, Oxford University Press. _Electronic Fundamental Applications: Integrated and Discrete Systems by J.D. Ryder, Prentice Hall"
            }
        ]
    },
    {
        "id": 5,
        "code": "ma-111",
        "title": "engineering mathematics-i",
        "credits": [4,3,1,0],
        "units": [
            {
                "id": 1,
                "title": "Matrix Algebra",
                "topics": "Matrices, Related matrices, Complex matrices Hermitian and skew-Hermitian matrices, Unitary matrix), Rank of a matrix, Gauss-Jordan method, Normal form of a matrix, Linear dependence and independence of vectors, Consistency of linear system of equations, Solution of linear system of equations, Characteristic equation, Eigen values, Eigen vectors, Properties of eigen values, Cayley-Hamilton theorem and its applications, Reduction to diagonal form, Quadratic form and their reduction to canonical form"
            },
            {
                "id": 2,
                "title": "Differential Calculus ",
                "topics": "Review of Limits, Continuity and Differentiability, Mean Value Theorem, Partial Differentiation and its geometrical interpretation, Homogeneous functions, Euler’s theorem and its extension, Total differentials, Composite function, Jacobian, Taylor’s and Maclaurin’s infinite series, Indeterminate forms, Errors and increments, Maxima and minima of functions of two variables, Method of undetermined multipliers. Curve tracing"
            },
            {
                "id": 3,
                "title": "Integral Calculus",
                "topics": "Double Integrals (Cartesian and Polar), Change of Order of Integration, Change of Variables, Applications of Double Integrals. Triple integrals, Change of Variables, Applications of Triple Integrals. Beta and Gamma functions"
            },
            {
                "id": 4,
                "title": "Vector Calculus ",
                "topics": "Differentiation of vectors, Curves in space, Velocity and acceleration, Relative velocity and acceleration, Scalar and vector point functions, Vector Operator ‘Del’ - Del Applied to Scalar Point Functions (Gradient) and its Geometrical Interpretation - Directional Derivative,  Del Applied to Vector Point Function (Divergence  and Curl) and their Physical Interpretation, Del Applied Twice to Point Function, Del Applied to Products of Point Functions. Integration of Vector, Tangential Line Integral,  Normal Surface Integral, Volume integrals, Theorems of Green, Stokes and Gauss (without proofs) and their verifications and applications,  Irrotational Fields, Solenoidal Fields"
            },
            {
                "id": 5,
                "title": "Fourier Series",
                "topics": "Euler’s formula, Dirichlet’s Conditions, Functions Having Points of Discontinuity, Change of interval, Expansion of odd and even periodic functions, Half-range series, Typical wave-forms, Parseval’s formula, Practical harmonic analysis"
            },
            {
                "id": 0,
                "title": "Books",
                "topics": "Advanced Engineering Mathematics by E. Kreyszig, John Wiley and Sons, NC, New York._Thomas’ Calculus by G.B. Thomas, M.D. Weir, J. Hass, Pearson Education India._Advanced Engineering Mathematics by C.R. Wylie & L. C. Barrett, McGraw Hill._Vector Calculus by C. E. Weatherburn, John Wiley and Sons, NC, New York._Advanced Engineering Mathematics by R.K. Jain and S.R.K. Iyenger, Narosa Pub. House._Differential & Integral Calculus by N. Piskunov, MIR Publications"
            }
        ]
    },
    {
        "id": 6,
        "code": "ma-121",
        "title": "engineering mathematics-ii",
        "credits": [4,3,1,0],
        "units": [
            {
                "id": 1,
                "title": "Ordinary Differential Equations ",
                "topics": "Brief review of ordinary differential equations, Exact equations, Equations reducible to exact equations, Equations of the first order and higher degrees, Clairaut’s equation. Applications of ODEs in concerned engineering branch. Linear differential equations with constant co-efficient, Complimentary functions and particular integral, Method of variation of parameters, Equations reducible to linear equations with constant co-efficient (Cauchy’s and Legendre’s linear equations), Initial and Boundary value problems, Simultaneous linear equations with constant co-efficient, Applications of differential equations in concerned engineering branch"
            },
            {
                "id": 2,
                "title": "Partial Differential Equations",
                "topics": "Formulation of Partial Differential Equations (PDE), Solution of PDE, Linear PDE of First Order (Lagrange’s Linear Equation), Non-linear Equation of First Order (Standard Forms), Charpit’s Method, Homogeneous Linear Equations with Constant Coefficients, Non-homogeneous Linear Equations.Applications of PDE: Method of separation of variables, Solution of one dimensional wave and heat equation and two dimensional Laplace’s equation"
            },
            {
                "id": 3,
                "title": "Transforms Theory",
                "topics": "Laplace Transform: Laplace Transforms of standard functions and their properties, Inverse Laplace Transforms, General Properties of inverse Laplace transforms and Convolution Theorem, Laplace Transforms of periodic functions, Dirac-delta Function, Heaviside’s Unit Function, Solution of ODE and linear simultaneous differential equations using Laplace transforms. Fourier Transform: Fourier integral representation, Fourier sine, cosine and complex transform, Finite Fourier Transforms and their applications. Z – Transforms: Z–Transforms & its properties, inversion of Z – transform and applications of Z – transform"
            },
            {
                "id": 4,
                "title": "Probability and Statistics",
                "topics": "Review of probability, Conditional probability and sampling theorems, Discrete and Continuous Probability Distribution, Probability Mass & Probability Density Functions, Distribution function, Discrete and Continuous probability distributions, Binomial, Poisson and Normal distributions"
            },
            {
                "id": 0,
                "title": "Books",
                "topics": "Advanced Engineering Mathematics by E. Kreyszig, John Wiley and Sons, NC, New York._Differential Equations by S. L. Ross, John Wiley & Sons, New York._An Introduction to Probability Theory & its Applications by W. Feller, Wiley._Probability and Statistics for Engineers and Scientists by R.E. Walpole, S. L. Myers and K. Ye, Pearson._Integral Transforms and Their Applications by Lokenath Dennath and Dambaru Bhatta, Chapman and Hall/CRC Press"
            }
        ]
    },
    {
        "id": 7,
        "code": "cs-101",
        "title": "computer programming",
        "credits": [3,3,0,0],
        "units": [
            {
                "id": 1,
                "title": "Programming Fundamentals",
                "topics": "Introduction to computer, block diagram and organization of computer, number system and binary arithmetic, processing data, hardware, software, firmware, types of programming language-Machine language, Assembly level language, higher level language, source file, object file, translatorsassembler, compiler, interpreter. Evolution and classification of programming languages"
            },
            {
                "id": 2,
                "title": "Programming Techniques",
                "topics": "Steps in program development, algorithm, flowchart, pseudo code"
            },
            {
                "id": 3,
                "title": "C Language",
                "topics": "'C’ character set, literals, keywords, identifiers, data types and size, variable declaration, expression, labels, statements, formatted input output statements, types of operators, data type conversion, mixed mode arithmetics, control structures"
            },
            {
                "id": 4,
                "title": "Data Structures",
                "topics": "Storage classes, scope rules and visibility, arrays,  pointers, dynamic storage allocation, structures and unions, self-referential structures. Relationship between pointers and arrays, dynamic arrays: Introduction to dynamic datastructures- linked lists, stack, and binary trees"
            },
            {
                "id": 5,
                "title": "Functions and File Handling",
                "topics": "‘C’ functions, library functions, parameter passing, recursion, ‘C’ files, function for file handling, ‘C’ pre-processors and command line arguments, macros and conditional compiler directives"
            },
            {
                "id": 0,
                "title": "Books",
                "topics": "C Programming Language by Briain W. Kenigham and Dennis Ritchie, Prentice Hall of India._Programming with C by Byron Gottfried, Tata McGraw Hill._The Complete Reference C by Herbert Schildt, Tata McGraw Hill._Let us C by Yashwant Kanetkar, BPB Publication._A Structured Programming Approach in C by B.A. Forouzan and R.F. Gilberg, Cengage Learning"
            }
        ]
    },
    {
        "id": 8,
        "code": "hs-101",
        "title": "communication skills",
        "credits": [3,2,1,0],
        "units": [
            {
                "id": 1,
                "title": "Introduction",
                "topics": "Role of Effective Communication Skills for an Engineer, Theories of acquiring and learning English as a Second language, Challenges in learning language and means to overcome these"
            },
            {
                "id": 2,
                "title": "Communication process",
                "topics": "Types and modes of communication, Formal and Informal Communication,  Process, Channels and levels of communication in Organizations ,  Intrapersonal and interpersonal communication, Common frame of reference and Context for effective communication, Verbal and Non verbal communication,  Interpreting non-verbal communication, Barriers to effective communication "
            },
            {
                "id": 3,
                "title": "Effective Listening Skills",
                "topics": "What does listening mean? Types of listening, Strategies for effective listening, Listening for specific purposes, Listening process and barriers to listening, Leadership and role of effective listening, Problems in comprehension and retention, note taking, Exposure to recorded audio/visual text for listening "
            },
            {
                "id": 4,
                "title": "Effective Speaking Skills",
                "topics": "Interviews and Group discussion: Telephonic and personal interviews, Pre-Interview planning SWOT analysis, Building self-confidence, Developing Emotional intelligence, Preparing for current topics, Group Discussion as an interviewing tool Public speaking: Become aware of personal speech habits and characteristics. Improving non-verbal cues, voice, diction and other mechanics of speech.  Speech preparation and presentation techniques, Audience awareness and self-awareness, Cultivating poise and self-confidence. Presenting a variety of speeches (informative, persuasive, demonstrative, special occasion, etc.)"
            },
            {
                "id": 5,
                "title": "Reading Skills",
                "topics": "Need and process, Approach to different reading materials, Purposes of reading,Different reading strategies: Skimming, Scanning Predicting, Inferring from the context Reading,Comprehension, Vocabulary expansion through reading"
            },
            {
                "id": 6,
                "title": "Writing Skills",
                "topics": "Need and  strategy, Developing Style of Writing, Role of appropriateness, brevity and clarity in writing, Cohesion and Coherence, Paragraph writing, Vocabulary building (roots, prefixes, suffixes) SOP, Resume/CV, Job applications Report writing: Importance of Technical Report Writing, Types of Reports, Objectivity in Report Writing, Collection of Data for Report writing"
            },
            {
                "id": 0,
                "title": "Books",
                "topics": "Business Communication Today by Bovee, Courtland, L., John V. Thill and Barbara E. Schatzman: Pearson Education: Delhi._The Definitive Book of Body Language by Allan Pease and Barbara Pease. Manjul Publishing House: New Delhi._Communication for Business by Shirley Taylor. Longman: New Delhi._Technical Communication: Principles and Practice by Meenakshi Raman and Sangeeta Sharma. Oxford University Press: New Delhi"
            }
        ]
    },
    {
        "id": 9,
        "code": "me-101",
        "title": "engineering graphics",
        "credits": [3,1,0,3],
        "units": [
            {
                "id": 1,
                "title": "Introduction",
                "topics": "Importance of Engineering Drawing, Engineering Drawing Instruments and uses, B.I.S and I.S.O. Conventions for drawings, Use of plane scales and Representative Fraction"
            },
            {
                "id": 2,
                "title": "Projection of Points and Straight Lines",
                "topics": "Introduction to principal planes, Notation System, Projection of line parallel/ perpendicular to principal plane, Concept of true length of line"
            },
            {
                "id": 3,
                "title": "Projection of Planes",
                "topics": "Concept of different planes, Projections of planes with its inclination to one principal plane and with two principal planes. Concept of auxiliary plane method for projections of the plane"
            },
            {
                "id": 4,
                "title": "Projection of Solids and Sections of Solids",
                "topics": "Classifications of Solids, Projections of right and regular solids with their axis Parallel to two and Perpendicular to one of the principal planes, axis parallel to one and inclined to two principal planes, axis inclined to all the three principal planes. Section of solids"
            },
            {
                "id": 5,
                "title": "Orthographic Projections & Isometric Projection",
                "topics": "Principle of projection,Principal planes of projection, Projections from the pictorial view of the object on the principal planes using first angle projection method and third angle projection method, Full Sectional View, Isometric projection"
            },
            {
                "id": 6,
                "title": "Autocad’s Workspaces And User Interface",
                "topics": "The Drawing Area, Accessing Autocad Commands, Starting, Saving, And Opening Drawings, Closed User Interface, User Interface And Startup Tutorial, Coordinates, World Coordinate System/User Coordinate System, Coordinate Systems Tutorial, Drawing Using Coordinates Tutorial, Drawing Commands, Text & Modifying Commands, Object Snap Commands"
            },
            {
                "id": 7,
                "title": "Conventional Engineering Drawing",
                "topics": "Preparation of drawing sheet related to Scales and Representative Fraction. Preparation of drawing sheet related to Projection of Points and Straight Lines. Preparation of drawing sheet related to Projection of Planes. Preparation of drawing sheet related to Projection and Section of Solids. Preparation of drawing sheet related to Orthographic Projections. Preparation of drawing sheet related to Isometric Projections"
            },
            {
                "id": 8,
                "title": "Computer Aided Graphics ",
                "topics": "Learning of drawing software, utility of drawing commands, built in directory and tools. Learning of drawing units, sheet setting, practice of different drawing commands. Learning of text command layers block, insert blocks and dimensioning techniques"
            },
            {
                "id": 9,
                "title": "Computer Aided Modeling ",
                "topics": "Drawing of 2D and 3D models. Isometric drawings with different views. Complex solid models and wire frame models"
            },
            {
                "id": 0,
                "title": "Books",
                "topics": "A text book of Engineering Drawing by P.S.Gill, S.K.Kataria & Sons, Delhi._Engineering Drawing and Graphics by K. Venugopal, New Age International_Engineering Drawing with an Introduction to AutoCAD by D.A. Jolhe, Tata McGraw-Hill Publishing Co. Ltd., New Delhi._ Engineering Drawing & Graphics using Auto CAD 2000 by T. Jeyapoovan, Vikas Publishing House Pvt. Ltd., New Delhi"
            }
        ]
    },
    {
        "id": 10,
        "code": "me-102",
        "title": "engineering workshop",
        "credits": [3,1,0,3],
        "units": [
            {
                "id": 1,
                "title": "Department of Mechanical Engineering ",
                "topics": "Importance of Engineering Workshop and description about each shop. Brief Introduction of Engineering materials like Metals, Ceramics, Polymers and Composites. Brief description of machining operations and study about construction and working of Lathe Machine. Brief description of various joining processes. Brief description about Arc Welding and Gas Welding processes and their common applications. Brief description about tools used in foundry shop and methods of preparation of Green Sand mould. Brief description of tools used in carpentry shop and introduction to different joints used in carpentry shop. Brief description of various fitting operations and related tools"
            },
            {
                "id": 2,
                "title": "Department of Civil Engineering",
                "topics": "Introduction of Joinery details of plumbing fixtures for sanitary and water supply system Types, quality and strength characteristics of various building materials: cement, sand, aggregates, bricks. Introduction to non-destructive testing. Concept and detailing of reinforcement of various structural elements: beam, column, slab and footings/Types of Truss and its connection details"
            },
            {
                "id": 3,
                "title": "Department of Electrical Engineering",
                "topics": "Introduction to electrical tools, wires used and safety measures. Concept of soldering and design aspects of regulated power supply. Operation and maintenance of domestic electrical appliances"
            },
            {
                "id": 4,
                "title": "Mechanical Engineering Workshop",
                "topics": "Preparation of job as per given drawing using Lathe Machine. Preparation of job as per given drawing using Arc/Gas Welding Setup. Preparation of Green Sand Mould using tools of Foundry Shop. Preparation of job as per drawing related to Joints used in Carpentry Shop using Carpentry Tools. Preparation of job as per given drawing related to Fitting Shop. Preparation of job as per given drawing of Bolts and Nuts using tools of Smithy Shop"
            },
            {
                "id": 5,
                "title": "Civil Engineering Workshop",
                "topics": "Assembly of conduit fittings: Elbow joining, T joining, Tap and pipe, Union and reducer, trap and sanitary pipe fitting. Testing of samples: cement–lump formation, sand–sieve analysis, aggregates–sieve analysis, bricksCompressive strength. Preparation of cubes for testing of concrete. Assembly of reinforcement of beam, column, slab and footings with binding wire. Assembly of truss element with bolts and nuts"
            },
            {
                "id": 6,
                "title": "Electrical Engineering Workshop",
                "topics": "Wiring of fluorescent tube lamp for staircase lighting system. To assemble adjustable voltage power supply by soldering electronic components. To open, disconnect and re-connect internal wiring system of domestic electrical appliances     "
            },
            {
                "id": 0,
                "title": "Books",
                "topics": "A Course in Workshop Technology by B.S. Raghuwanshi,  DhanpatRai & Company(P) Limited._Elements of Workshop Technology by Hajra Choudhary & Nirjhar Roy,  Media Promoters and Publishers Pvt. Ltd. _Plumbing and Sanitary Engineering by J.B. Jindolia, Royal Publishers._Building Materials by S.K. Duggal, New Age International. Publishers._Electrical Wiring Estimating and Costing by S.L. Uppal & G.C. Garg Khanna Publication._Basic Electronics by Mitchel Schultz McGraw Hill Education._Electrical Appliances: The Complete Guide to the Maintenance and Repair of Domestic Electrical Appliances by Graham Dixon Haynes Publishing Group"
            }
        ]
    },
    {
        "id": 11,
        "code": "ph-101",
        "title": "engineering physics  ",
        "credits": [4,3,1,0],
        "units": [
            {
                "id": 1,
                "title": "Semiconductor Device Physics",
                "topics": "Energy bands in solids, the E-k diagram, Density of states, Occupation probability, Fermi level and quasi Fermi levels, Fermi-Dirac Statistic, Effective mass, Conductivity as a function of temperature p-n junctions, Schottky junction and Ohmic contacts"
            },
            {
                "id": 2,
                "title": "Laser Physics",
                "topics": "Concepts of laser, spontaneous and stimulated emission, elementary idea about Lasers, basic principles involves in laser, three and four level laser system, coherence, characteristics of laser light; ruby, He-Ne, CO2 and semiconductor lasers, application of lasers"
            },
            {
                "id": 3,
                "title": "Fibers Optics and Photonics",
                "topics": "Optical Fiber, physical structure and basic theory, modes in optical fibers, step index and graded index fibers, losses in optical fibers, sources and sensors for optical fibers, applications of optical fibers in communication"
            },
            {
                "id": 4,
                "title": "Fibers Optics and Photonics",
                "topics": "Gauss’s Law in dielectric medium, Equation of continuity, displacement current, Maxwell’s equations, wave equation for electromagnetic radiation, electromagnetic wave propagation in free space and isotropic dielectric medium, Poynting theorem & Poynting vector"
            },
            {
                "id": 5,
                "title": "Quantum Mechanics",
                "topics": "Need of quantum mechanics, Compton effect, Born’s concept of wave function, eigen function and eigen values, operators in quantum mechanics, expectation values, time independent,time dependant Schrodinger’s wave equations and its applications viz., particle in one dimensional potential well"
            },
            {
                "id": 5,
                "title": "Superconductivity and Ultrasonics",
                "topics": "Introduction and discovery of superconductivity, superconducting materials, Meissner effect, critical magnetic field and critical current, type-1 and type-2 superconductors, isotope effect, theory of superconductivity, ultrasonics, generation, properties and applications"
            },
            {
                "id": 0,
                "title": "Books",
                "topics": "Solid State Electronic Devices by B. G. Streetman, Prentice Hall of India, New Delhi 2006._Introduction to Solid State Physics by Kittle C. John Wiley & Sons, 2005._Lasers Fundamentals and Applications by Ghatak  A. K. & Thyagarajan K, Springer, 2010._Modern Engineering Physics; A.S. Vasudeva, S. Chand & Co. Ltd._Introduction to Electrodynamics  by Griffiths D. J, Pearson Education Pvt. Ltd., New Delhi, 2002_Quantum Mechanics by Ghatak A and Lokanathan S  Mc Millan India Ltd"
            }
        ]
    },
    {
        "id": 12,
        "code": "cy-101",
        "title": "engineering chemistry",
        "credits": [4,3,1,0],
        "units": [
            {
                "id": 1,
                "title": "Environmental Science ",
                "topics": "Specifications of domestic and industrial water, water treatment, water quality parameters, waste/sewage water treatment, BOD, COD, Air quality standard, air pollution and its control, smog formation, photochemical smog, green house effect and Global Warming, Chemical pollutants, Carbon credit, Climate Change, Introduction to Environmental impact assessment "
            },
            {
                "id": 2,
                "title": "Characterisation Techniques  ",
                "topics": "Introduction to spectroscopy, UV-Visible spectroscopy-  Absorption laws, Instrumentation, formation of absorption bands, Chromophore and auxochrome concept, application of UVVisible spectroscopy; IR spectroscopy - Principle, selection rules, spectral features of some classes of compounds, important features of IR spectroscopy and application; Introduction to Thermal methods, instrumentation and applications (TGA, DTA, DSC) "
            },
            {
                "id": 3,
                "title": "Nanochemistry ",
                "topics": "Introduction to nanochemistry: dependence of optical, electrical and magnetic properties on size of materials, various nanostructures; spherical nanoparticles, nanotubes, nanofibers, nanorods, etc, synthesis, properties and applications of following nanomaterials -  Carbon based nanostructures – CNTs and graphene, semiconductors nanoparticles- TiO2. Characterization of nanomaterials: atomic force microscopy (AFM), scanning electron microscopy (SEM) "
            },
            {
                "id": 4,
                "title": "Corrosion and its Control  ",
                "topics": "Introduction, Types of corrosion-chemical and electrochemical, Mechanisms of corrosion, factors affecting corrosion and different protection methods for corrosion control"
            },
            {
                "id": 5,
                "title": "Lubricants  ",
                "topics": "Introduction, Mechanisms of lubrication, Types of lubricants, properties and different methods for testing of lubricant oils and greases"
            },
            {
                "id": 0,
                "title": "Books",
                "topics": "Spectrometric Identification of Organic Compounds by R. M. Silverstein, F. X. Webseter, and D. Kiemle, John Wiley & Sons _Organic Spectroscopy by W. L. Kemp, Palgrave. _Spectroscopy by D. L. Pavia, Cengage.  _Engineering Chemistry by Jain & Jain, Dhanpat Rai Publishing Co. _A text Book of Engineering Chemistry by Shashi Chawla, Dhanpat Rai & Co. _Engineering Chemistry by S.Vairam and S. Ramesh, Wiley. _Nanotechnology, Principles and Practices by Sulabha K .Kulkarni, Capital Publishing Company. _Introduction to Environmental Engineering by M. Davis, D. Cornwell, Mcgraw-hill"
            }
        ]
    },
    {
        "id": 13,
        "code": "ce-101",
        "title": "applied mechanics ",
        "credits": [4,3,1,0],
        "units": [
            {
                "id": 1,
                "title": "Introduction to Statics",
                "topics": "Particle and Rigid Body, Types of forces, Transmissibility of a force, vector algebra. Two dimensional force system:  Resolution of forces,  Moment of forces, Couple, Resolution of a coplanar force by its equivalent force-couple system, Resultant of forces, free body diagram, equilibrium"
            },
            {
                "id": 2,
                "title": "Centre of Gravity and Moments of inertia",
                "topics": "Centroid of plane, curve, area, volume and composite bodies MI with respect to different axis, Parallel axis theorem, Mass moment of inertia. Virtual work and Energy method: Principle of virtual work; Applications of virtual work principle to machines; Mechanical efficiency; Work of a force/couple, Potential energy and equilibrium. Concept of Friction: Laws of Coulomb friction, Angle of Repose, Coefficient of friction, large and small contact surfaces, Belt friction, Equilibrium of a belt, Bearing friction "
            },
            {
                "id": 3,
                "title": "Kinematics of Rigid Body",
                "topics": "Introduction, Plane Motion of Rigid Body, Velocity and Acceleration under Translation and Rotational Motion, Relative Velocity, Kinetics of Rigid Body: Introduction, Force, Mass and Acceleration, Work and Energy, Impulse and Momentum, D’Alembert’s Principles and Dynamic Equilibrium"
            },
            {
                "id": 4,
                "title": "Impulse Momentum Principle",
                "topics": "Impulsive force, Conservation of Linear momentum and Angular momentum. Impact between bodies"
            },
            {
                "id": 5,
                "title": "Simple stresses and strains",
                "topics": "Normal stress, Shear stress, Bearing stress, Normal strain, Shearing strain; Hooke’s law; Poisson’s ratio; Factor of safety. Bending stress of Beams: Introduction, Simple Bending Theory, Stress in beams of different cross sections, shear stress, combined stresses"
            },
            {
                "id": 6,
                "title": "Torsion, Analysis of Truss, Analysis of frames",
                "topics": "Introduction, Torsion of shafts of circular section, torque and twist, shear stress due to torque. Method of joints, Method of Sections. Shear force and bending moment diagram of determinate beams and frame"
            },
            {
                "id": 0,
                "title": "Books",
                "topics": "Introduction to Solid Mechanics by H. Shames & J. M. Pitarresi, PHI._Mechanics of Materials by E.P. Popov, PHI._Vector Mechanics for Engineers: Statics and Dynamics by F. P. Beer, R. Johnston ,  D. F. Mazure  P. J. Cornwell , S. Sanghi, McGraw Hill Education"
            }
        ]
    },
    {
        "id": 14,
        "code": "ms-101",
        "title": "materials science and engineering ",
        "credits": [3,3,0,0],
        "units": [
            {
                "id": 1,
                "title": "Introduction",
                "topics": "Why study materials science and engineering? Review of basic types of interatomic bonds, Classification of materials, Processing/structure/properties/ performance correlations "
            },
            {
                "id": 2,
                "title": "Structure and Imperfections",
                "topics": "Lattices, Unit cells,Miller indices of directions and planes for cubic and hexagonal systems, Closepacking in solids, Common metallic structures,Voidsin close-packed structures, Common ceramics structures – NaCl, CsCl, Diamond Cubic, Zinc Blende, Wurtzite, Rutile, Fluorite, Fullerenes, Spinel, Perovskite, etc., Polycrystalline materials, X-Ray diffraction for determination of crystal structures,Solid state diffusion – Ficks laws of diffusion, Diffusion mechanisms, Temperature dependendence of diffusivity, Defects in crystals - Point defects, Dislocations, Grain boundaries and Surfaces, Noncrystalline solids, Polymeric materials"
            },
            {
                "id": 3,
                "title": "Phase Diagrams",
                "topics": "Phase rule, Solid solutions, Hume-Rothery rules, Intermediate phases and compounds, Unary and binary phase diagrams, Isomorphous and eutectic systems, Lever rule, Typical phasediagrams: Fe-C, Cu-Ni, Cu-Zn, Al-Cu, Al-Si and Pb-Sn."
            },
            {
                "id": 4,
                "title": "Phase Transformations and Heat Treatment",
                "topics": "Classification of phase transformations, Liquid to solid transformation, Homogeneous and heterogeneous Nucleation, Kinetic considerations in solid state transformations, Microstructure and property changes in iron-carbon alloys, Isothermal transformation diagrams, Continuous cooling diagrams, Annealing, normalizing, hardening andtempering of steels and their effect on properties, Hardness andhardenability. Quenching media, Martempering and austempering, Surface hardening— carburizing, nitriding, carbonitriding, flame and induction hardening, Precipitation and age hardening "
            },
            {
                "id": 5,
                "title": "Properties of Materials",
                "topics": "Mechanical Properties: Stress-strain response of metallic, ceramic and polymermaterials, yield strength, tensile strength and modulus of elasticity, toughness, plastic deformation, fatigue, creep and fracture; Electronic Properties: Free electron theory, Fermi energy, density of states, elementsof band theory, semiconductors, Hall effect, dielectric behaviour, piezo, ferro,pyroelectricmaterials, Magnetic Properties: Origin of magnetism in metallic and ceramic materials, paramagnetism, diamagnetism, ferro andferrimagnetism; Thermal Properties: Specific heat, thermal conductivity and thermal expansion,thermoelectricity. Optical Properties: Refractive index, absorption and transmission of electromagnetic radiation in solids, electrooptic and magnetoopticmaterials, spontaneous and stimulated emission, gas and solid state lasers"
            },
            {
                "id": 0,
                "title": "Books",
                "topics": "Materials Science and Engineering, An Introduction by William D. Callister, Jr. and David G. Rethwisch,John Wiley and Sons, Inc._Materials Science and Engineering by William F. Smith, McGraw Hill Education._Modern Physical Metallurgy by R. E. Smallman, Butterwort- Heinemann._Physical Metallurgy: Principles and Practice by V. Raghvan, PHI Learning Private Ltd"
            }
        ]
    },
    {
        "id": 15,
        "code": "ec-101",
        "title": "basic electronics engineering",
        "credits": [3,3,0,0],
        "units": [
            {
                "id": 1,
                "title": "Semi-Conductors and Diodes",
                "topics": "Introduction, Insulators, Semiconductors and Metals, Mobility and Conductivity, Intrinsic and Extrinsic Semiconductors, Charge Density, Current Components in Semiconductors, Continuity Equation, PN Junction Diode- Characteristics and Analysis; Types of Diodes- Zener Diode, Photodiodes, LED, Varactor Diode, Tunnel Diodes"
            },
            {
                "id": 2,
                "title": "Diode Applications",
                "topics": "Rectifiers and Filter Circuit: Half Wave Rectifier, Full Wave Rectifier, Bridge Rectifier and their Analysis, L,C and Pi Filters; Series and Shunt Diode Clippers, Clipping at Two Independent Levels, Clamping Operation, Clamping Circuit; Practical Clamping Circuits, Basic Regulator Supply using Zener Diode"
            },
            {
                "id": 3,
                "title": "Bipolar Junction Transistors",
                "topics": "Construction and Characteristics of BJT, Transistor Configuration: CB, CE, CC Configuration; Transistor at Low Frequency, Small Signal Low Frequency Transistor Model (H-Parameters), Analysis of Transistor Amplifier using HParameters"
            },
            {
                "id": 4,
                "title": "Transistor Biasing",
                "topics": "Transistor Biasing and Bias Stabilization: Operating Point, Stability Factor, Analysis of Fixed Bias, Collector to Base Bias, Emitter Resistance Bias Circuit and Self Bias Circuit, Bias Compensation Techniques Transistor Switch and Transistor amplifier"
            },
            {
                "id": 5,
                "title": "Field Effect Transistor",
                "topics": "Construction and Characteristics of JFET, JFET Biasing Circuit, JFET Amplifier, MOSFET Construction and Characteristics"
            },
            {
                "id": 6,
                "title": "Basics of Communication System",
                "topics": "Introduction to Analog and Digital Communication Systems, Block Diagram Representation of Communication System, Basic idea of Transmitter and Receiver used for radio communication, Various Frequency bands used for Communication, Need of Modulation and Introduction to Cellular Communication"
            },
            {
                "id": 0,
                "title": "Books",
                "topics": "Integrated Electronics by J. Millman and C.C. Halkias, McGraw Hill Education, India._Electronics Devices and Circuit Theory by R. Boylestad and L. Nashelsky, Pearson India._Electronics Devices and Circuits-II by U. A. Bakshi and A. P. Godse, Technical Publications._Electronic principles by L. Malvino, Tata McGraw Hill Education._Semiconductor Devices by K. Kano, Prentice Hall Publication._Electronic Communication Systems by G. Kennedy, McGraw Hill Education, India"
            }
        ]
    },
    {
        "id": 16,
        "code": "ee-101",
        "title": "basic electrical engineering ",
        "credits": [4,3,1,0],
        "units": [
            {
                "id": 1,
                "title": "Analysis of DC Circuits",
                "topics": "Linear and non-linear circuits, circuit elements, various sources and source transformation, star delta transformation, solution of DC circuits using Kirchoff's laws, signal wave forms and passive elements specifications, Network theorems, response of first order circuits for DC excitation"
            },
            {
                "id": 2,
                "title": "AC Circuits, Domestic Electric Wiring & Storage Batteries",
                "topics": "Generation of AC sinusoidal voltage and currents, average and r.m.s values, Form factor and peak factor, phasor representation  in polar, rectangular and exponential forms, terminal relationship for pure passive elements and their combination in series and parallel, analysis of single phase series, parallel and series-parallel circuits, active and reactive power, power factor and volt-amperes, frequency response and Q-factor, analysis of balanced three phase AC circuits, concept of voltage, current and power in three phase balanced circuits, Basics of  Domestic Electric Wiring and Storage Batteries"
            },
            {
                "id": 3,
                "title": "Electromagnetic Circuits and Transformer",
                "topics": "Magnetic circuit concept, B-H curves characteristics of magnetic materials, practical magnetic circuits, magnetic circuits with DC and AC excitation, hysteresis and eddy current losses, Magnetic force, self and mutual inductances, Faraday’s laws, Lenz’s Law, statically and dynamically induced emfs, energy stored in magnetic fields, Principle of Transformer operation, construction and equivalent circuit of transformer"
            },
            {
                "id": 4,
                "title": "Measuring Instruments",
                "topics": "Introduction to galvanometer (Moving coil and moving iron), ammeter, voltmeter, wattmeter, energy meter, use of shunt and multiplier"
            },
            {
                "id": 5,
                "title": "Electrical Machines",
                "topics": "Fundamentals of DC and AC machines"
            },
            {
                "id": 0,
                "title":"Books",
                "topics": "Fundamental of Electric Circuits by Charles K Alexander and Matthew N. O. Sadiku, TMH Publication._Electrical Engineering Fundamentals by Vincent Del Toro, PHI Publication._Basic Electrical Engineering by V N Mittal & Arvind Mittal, TMH Publication._Basic Electrical Technology by A.E. Fitzgerald, McGraw Hill Publication.  _Electrical Estimating and Costing by N Alagappan and B Ekambaram, TMH Publication"
            }
        ]
    },
    {
        "id": 17,
        "code": "cs-102",
        "title": "computer programming lab ",
        "credits": [1,0,0,2],
        "units": [
            {
                "id": 20,
                "title": "List of Experiments ",
                "topics": "Familiarity with Windows utilities and basic Linux commands._Programs related to operators and evaluation of expressions._Programs to illustrate use of arrays._Programs on operations over strings._Programs related to use of functions._Using pointers in programs._Programs on logical operators._Programs making use of structures and unions._Programs to perform operations over various data structures viz, linked lists, stacks, trees, etc._Programs that read/write data from/to files._Programs using preprocessor directives. Use of command line arguments in program._Programs using graphics tools"
            }
        ]
    },
    {
        "id": 18,
        "code": "hs-102",
        "title": "communication skills lab ",
        "credits": [1,0,0,2],
        "units": [
            {
                "id": 20,
                "title": "List of Experiments ",
                "topics": "Sky Pronunciation: Introduction to the Speech Sounds of English._Sky Pronunciation: Syllable and Organs of Speech._Sky Pronunciation: Vowel and Consonant Sounds._Sky Pronunciation: Similar sounds and test._Word Stress and Intonation using available software._Listening and Comprehension using available software._Listening to Native speakers of English language._Watching short talks for learning effective presentation skills._Presentation skills using technology enabled slides._Just a Minute (JAM) Sessions._Describing Objects/Situations/People._Interview skills using available software/interview videos"
            }
        ]
    },
    {
        "id": 19,
        "code": "ph-102",
        "title": "engineering physics lab ",
        "credits": [1, 0,0,2],
        "units": [
            {
                "id": 20,
                "title": "List of Experiments ",
                "topics": "To determine the specific resistance of a material wire using a post office box.._To find the area of a rectangle (or height of an inaccessible object) using a sextant._Conversion of a galvanometer into Ammeter and Voltmeter of given range._To verify the inverse square law of magnetism._Study the variation of magnetic field with distance along the axis of a circular coil carrying current and to find the radius of the coil._To determine the refractive index of a glass/  liquid (water) using Spectrometer._To determine the wavelength of light using Newton’s ring apperatus._To verify the inverse square law for the intensity of radiation from a source of light._To determine the wavelength of the Laser light using diffraction method._To find magnifying power of a telescope by linear method._To measure Young’s modulus by bending of beam method._Study of the attenuation and propagation characteristics of an optical fiber cable._Other experiments as and when made available time to time"
            }
        ]
    },
    {
        "id": 20,
        "code": "cy-102",
        "title": "engineering chemistry lab ",
        "credits": [1, 0,0,2],
        "units": [
            {
                "id": 20,
                "title": "List of Experiments ",
                "topics": "Estimation of residual Chlorine in a given sample of water._Estimation of chloride content in a given sample of water by Mohr’s method (Argentometrically)._Estimation of concentration of hydroxyl, carbonate, bicarbonate and total alkalinity in a given sample of water._Estimation of Hardness (Temporary and Permanent) in a given sample of water_Determination of quantity of Ferrous ions in a sample of water by KMnO4 titration._Estimation of concentration of iron in an iron ore by dichrometry._Estimation of Cu in a given sample of brass._Determination of Viscosity of unknown liquid by Ostwald’s viscometer._Determination of surface tension of unknown liquid by drop number method._Estimation of calcium in Limestone or Dolomite._Verification of the absorption laws by using Colorimetric method._Determination of the concentration of nickel using Absorption technique"
            }
        ]
    },
    {
        "id": 21,
        "code": "ec-102",
        "title": "electronics engineering lab ",
        "credits": [1, 0,0,2],
        "units": [
            {
                "id": 20,
                "title": "List of Experiments ",
                "topics": "Familiarization of electronic components and equipments like CRO, function generator and power supplies etc._To study the V-I characteristics of p-n junction diode and determine its static and dynamic resistance._To study the characteristics of Zener diode and hence, calculate the dynamic resistance._To study voltage regulator circuit using Zener diode._To study and plot the waveform of half wave and full wave rectifier with and without capacitor filter._To study and plot the input and output characteristics of CE (Common Emitter) transistor configuration and calculate its input and output resistance._To study and plot the input and output characteristics of CB (Common Base) transistor configuration and calculate its input and output resistance._To study and plot the input and output characteristics of CC (Common Collector) transistor configuration and calculate its input and output resistance._To study the characteristics of FET (Field Effect Transistor) and calculate its dynamic resistance (rd), mutual conductance (gm) and amplification factor (µ)._To study the frequency response of single stage CE amplifier circuit using BJT and calculate the bandwidth (3 dB)._To study the frequency response of single stage amplifier circuit using FET and calculate the bandwidth (3 dB)._To study self bias circuit and calculate zero signal value of current and voltage"
            }
        ]
    },
    {
        "id": 22,
        "code": "ee-102",
        "title": "electrical engineering lab ",
        "credits": [1, 0,0,2],
        "units": [
            {
                "id": 20,
                "title": "List of Experiments ",
                "topics": "To verify Ohm’s law for BPLL (Bilateral Passive Linear Lumped) element._To find for a filament lamp: (i) Variation of resistance with voltage (ii) Variation of power with voltage._To find minimum fusing current and fuse constant of a given fuse wire._To calibrate a given voltmeter with the help of standard ammeter and resistance_To calibrate a given ammeter with the help of standard voltmeter and resistance._To find voltage current relationship in R-L series circuit and to determine power factor of the circuit._To calibrate given wattmeter by direct loading._To calibrate single phase energy meter by direct loading._Verification of Kirchhoff’s Laws: (i) KVL (Kirchhoff’s Voltage Law) (ii) KCL (Kirchhoff’s Current Law)_Determination of inductance of a coil using voltmeter and ammeter methods._To verify total resistance 𝑅 of the series connected resistances 𝑅=𝑅1+𝑅2+𝑅3"
            }
        ]
    },
    {
        "id": 23,
        "code": "ec-224",
        "title": "VLSI Technology ",
        "credits": [4,3,1,0],
        "units": [
            {
                "id": 1,
                "title": "Introduction to VLSI",
                "topics": "Concept Miniaturization of Electronic Systems & its impact on characterization"
            },
            {
                "id": 2,
                "title": "Monolithic Fabrication Techniques",
                "topics": "Crystal growth: Source of silicon; Single crystalline and Poly crystalline; Requirement of purity for electronics industry; Electronics grade silicon production, Crystal growth techniques: Bridgeman method; Float zone method; Czocharalski method; Modified Czocharalski method; refining; Silicon Wafer Preparation & Crystal Defects. Epitaxial Process: Need of epitaxial layer; vapors phase epitaxy -reactor design, Chemistry of epitaxial process, Transport mechanism doping & auto doping; selective epitaxy, Epitaxial process induced defects, Molecular beam epitaxy, Merits and demerits among epitaxial processes; recent trends in Epitaxy. Oxidation: Importance of oxidation; types of oxidation techniques; growth mechanism & kinetics; factors affecting the growth mechanisms; silicon oxidation model, dry & wet oxidation; oxidation induced faults; recent trends in oxidation. Lithography: Basic steps in lithography; Lithography techniques-optical lithography, Electron beam lithography, X-ray lithography, Ion beam lithography; resists and mask preparation of respective lithographies, Printing techniques-contact, Proximity printing and projection printing; merits and demerits of lithographies; recent trends in lithography at nano regime. Etching: Performance metrics of etching; types of etching- wet and dry etching;  dry etching techniques-ion beam or ion-milling, Sputter ion plasma etching and reactive ion etching (RIE); merits and demerits of etching; etching induced defects; recent trends in epitaxy. Diffusion and Ion Implantation: Diffusion mechanisms; diffusion reactor;    diffusion profile; diffusion kinetics; parameters affecting diffusion profile; Dopants and their behavior, choice of dopants; Ion Implantation- reactor design, impurity distribution profile, Properties of ion implantation, Low energy and high energy ion implantation.  Metallization: Desired properties of metallization for VLSI; metallization choices; metallization techniques – vacuum evaporation, Sputtering"
            },
            {
                "id": 3,
                "title": "Packaging of VLSI Chip",
                "topics": "Introduction to packaging; packaging process; package design considerations, Various packages types"
            },
            {
                "id": 4,
                "title": "Isolation Techniques in Monolithic Components",
                "topics": "Isolation techniques in Diodes, BJT and MOSFETs (Enhancement and depletion mode)"
            },
            {
                "id": 5,
                "title": "Monolithic Components- Prototype Fabrication",
                "topics": "Prototype fabrication of Diodes, npn BJT, pnp BJT, MOSFETs (Enhancement and depletion mode), n-MOS, p-MOS, CMOS, Resistors and Capacitors"
            },
            {
                "id":0,
                "title":"Books",
                "topics":"VLSI Technology by S.M. Sze, Tata Mc-Graw Hill_VLSI Fabrication Principles by S.K. Gandhi, John Willey & Sons_Integrated Circuits by K. R. Botkar, Khanna Publishers_Micromachined Transducer by G.T.A. Kovacs, McGraw Hill, 1998_Principles of Microelectronics Technology by D. Nagchoudhary, PHI "
            }
        ]
    },
    {
        "id": 24,
        "code": "ec-223",
        "title": "Electromagnetic Field Theory",
        "credits": [4,3,1,0],
        "units": [
            {
                "id": 1,
                "title": "Introduction",
                "topics": "Fundamental of vector algebra, Scalar &vector fields, Introduction and transformation on different coordinate systems: (rectangular, cylindrical and spherical coordinate system), introduction to line, Surface and volume integrals, Definition of gradient, Divergent and curl of a vector and their physical significance"
            },
            {
                "id": 2,
                "title": "Electrostatics",
                "topics": "Principle of Coulomb's law, Definition of electric field intensity from point charges, Field due to continuous distribution of charges on an infinite and finite line, Electric Field due to an infinite uniformly charged sheet, Gauss’s law and its applications, Electric flux density, Potential fields duo to electric dipole, Laplace’s and Poison’s equations"
            },
            {
                "id": 3,
                "title": "Magnetostatics",
                "topics": "Definition and explanation on Magnetic Field intensity due to a finite and infinite wire carrying current, Magnetic field intensity on rectangular loop carrying current, Ampere’s Circuital law and its applications, Biot-Savart’s law, Lorentz force equation for a moving charge, Magnetic Vector Potential"
            },
            {
                "id": 4,
                "title": "Time Varying EM Field",
                "topics": "Maxwell’s equation in differential and integral vector form and their interpretations, Continuity of currents, Conduction and displacement current, Boundary conditions, Helmholtz equations, uniform plane wave in dielectric and conductor media, Skin effect and depth of penetration, reflection and refraction of plane waves at boundaries for normal incidence and surface impedance, Energy Flow and Poynting theorem"
            },
            {
                "id": 5,
                "title": "Transmission Lines",
                "topics": "Transmission line model, Parameters and properties of transmission line equations, Reflections in transmission lines, Voltage, current and impedance relations-open, Short circuit and matched lines, Standing wave ratio, Impedance matching, Quarter and half wave lines, Single stub and double stub matching; Circle diagram – Smith-chart"
            },
            {
                "id": 0,
                "title":"Books",
                "topics":"Elements of Engineering Electromagnetics by Matthew N.O. Sadiku, Oxford University Press._Engineering Electromagnetics by William Hayt, TATA McGraw-Hill._Elements of Engineering Electromagnetics by Narayana Rao, N, Pearson Education._Electromagnetic Waves and Radiating Systems by Jordan and Balmain, PHI, Second Ed._Electromagnetics by J.D. Kraus, McGraw-Hill"
            }
        ]
    },
    {
        "id": 25,
        "code": "ec-225",
        "title": "Linear Integrated Circuits (LIC) Lab",
        "credits": [1,0,0,2],
        "units": [
            {
                "id": 20,
                "title": "List of Experiments",
                "topics": "To demonstrate the relationship between input and output in for the inverting and non-inverting configuration of the Op-Amp. 741._To verify the function of OP-Amp’s a summer and as a difference amplifier._To perform the mathematical operation of differentiation using basic and practical circuit of Op-Amp’s._To perform the mathematical operation of integration using basic and practical circuit of Op-Amp’s._To study the half wave and full wave rectifier circuits using Op-Amp’s._To design a first order butter worth low pass and high pass filter and determining its frequency response._To plot the frequency response of the band pass filter for a specified frequency range._To design a square, triangular and sawtooth wave generator using Op-Amp’s._To design the Wien Bridge oscillator using Op-Amp’s_To study the clipping and clamping circuits using operational amplifiers"
            }
        ]
    },
    {
        "id": 26,
        "code": "ec-226",
        "title": "Analog Communication Lab ",
        "credits": [1,0,0,2],
        "units": [
            {
                "id": 20,
                "title": "List of Experiments ",
                "topics": "Amplitude Modulation and Demodulation._DSB SC Modulation and Demodulation. _ SSB SC Modulation and Demodulation._ Frequency Modulation and Demodulation._ To Observe and Measure Frequency Deviation and Modulation Index._ Pre Emphasis - De Emphasis._ PAM Generation and Reconstruction _ PWM Generation and Reconstruction._ PPM Generation and Reconstruction._ Verification of Sampling Theorem._ Time Division and Frequency._ Phase Locked Loop."
            }
        ]
    },
    {
        "id": 27,
        "code": "ec-227",
        "title": "Circuit Design and Simulation Lab",
        "credits": [1,0,0,2],
        "units": [
            {
                "id": 20,
                "title": "List of Experiments",
                "topics": "Introduction to Tanner and Cadence EDA simulation tool._ To study the time and frequency response of series RLC circuit._ To study the frequency response of common emitter configuration of BJT._ To simulate N-MOS transistor and obtain its transfer and output characteristics._ To simulate-MOS transistor and obtain its transfer and output characteristics._To simulate MOS inverter using resistive load, CMOS inverter, pseudo NMOS inverter and enhancement mode CMOS inverter and obtain their VTC._ To simulate NAND and NOR logic gate using CMOS and study its performance._ To simulate EX-OR and EX-NOR logic gate using CMOS and study its performance._ To simulate half adder and Full adder using CMOS and study its performance._ Introduction to Physical simulation and TCAD._ Build a simulation mesh for diode and study its characteristics._ Build a simulation mesh for BJT and study its characteristics._ Build a simulation mesh for MOSFET and study its characteristics._ To study the CMOS inverter characterization using proto-type fabricated NMOS and PMOS"
            }
        ]
    },
    {
        "id": 28,
        "code": "ec-321",
        "title": "Microcontroller And Embedded Systems",
        "credits": [4,3,1,0],
        "units": [
            {
                "id": 1,
                "title": "Microcontroller",
                "topics": "Introduction to Microcontrollers, Evolution, Architectures, Implementations, Background and History of Embedded Systems, Characteristics of ES, Hardware/Software CoDesign, RISC vs CISC, MCS-51 Family Overview, Important Features, Architecture, 8051 Pin Functions, Architecture, Addressing Modes, Instruction Set, Instruction Types, Applications of ASIC and FPGA in ES"
            },
            {
                "id": 2,
                "title": "Programming",
                "topics": "Assembly Programming, Timer Registers, Timer Modes, Overflow Flags, Clocking Sources, Timer Counter Interrupts, Baud Rate Generation, Serial Port Register, Modes of Operation, Processing Interrupts, Interrupt Service Routines, Look-up Tables"
            },
            {
                "id": 3,
                "title": "Embedded Software Development",
                "topics": "Software development flow, Polling, Interrupt driven, Multitasking systems, Architecture of an RTOS, Important features of RTOS, Embedded Systems Programming, Locks and Semaphores, Operating System Timers and Interrupts, Exceptions, Tasks, Task states and scheduling, Task structures, Synchronization, Communication and concurrency, Semaphores, Real-time clock"
            },
            {
                "id": 4,
                "title": "32-Bit Cortex-M Architecture",
                "topics": "CPU architecture, Memory model, Registers, Modes, Exceptions, Interrupts, Exception handlers, interrupt controllers, Power modes, Hardware features and optimizations, Advanced bus standards like AMBA, The NVIC on ARM Cortex-M"
            },
            {
                "id": 5,
                "title": "Instruction Set of ARM",
                "topics": "Syntax, Addressing modes and operands, Memory access instructions, Logical operations, Shift operations, Arithmetic operations, Stack, Functions and control flow, Assembler directives, Thumb and arm instruction differences, Development with Keil and Mbed, Applications like IoT and machine learning with cortex-M"
            },
            {
                "id":0,
                "title":"Books",
                "topics":"The 8051 Microcontroller and Embedded Systems (2nd Ed.) by Mazidi Muhammad Ali, Pearson publications._The Definitive Guide to ARM Cortex-M3 processors (3rd Ed.) by Joseph Yiu, Newnes publication._Introduction to ARM Cortex-M Microcontrollers, Vol. 1 (5th Ed.) by Jonathan W. Valvano, Create Space._Real-Time Interfacing to ARM Cortex-M Microcontrollers, Vol. 2 (4th Ed.) by Jonathan W. Valvano, Create Space._Real-Time Operating Systems for ARM Cortex-M Microcontrollers, Vol. 3 (2nd Ed.) by Jonathan W. Valvano, Create Space."
            }
        ]
    },
    {
        "id": 29,
        "code": "ec-322",
        "title": "Wireless Communication",
        "credits": [4,3,1,0],
        "units": [
            {
                "id": 1,
                "title": "Introduction",
                "topics": "Evolution of wireless communication systems, Examples of wireless communication systems"
            },
            {
                "id": 2,
                "title": "The Cellular Concept – System Design Fundamentals",
                "topics": "Concept of frequency reuse, Channel assignment strategies, Handoff strategies, Interference and system capacity, Trunking and grade of service, Improving coverage and capacity in cellular systems"
            },
            {
                "id": 3,
                "title": "Propagation Models",
                "topics": "Free space propagation model, Two-ray ground reflection model, Distance power loss, Macrocell propagation model, Micro-cell propagation model, Shadowing model, Multipath effects in mobile communication, Models for multipath reception"
            },
            {
                "id": 4,
                "title": "Equalization, Diversity and Channel Coding",
                "topics": "Fundamentals of equalization, Adaptive equalizers, Linear and nonlinear equalization, Algorithms for adaptive equalization, Diversity techniques, Fundamentals of channel coding, Overview of error detection and correction codes"
            },
            {
                "id": 5,
                "title": "Multiple Access Techniques",
                "topics": "Introduction to multiple access, Frequency division multiple access, Time division multiple access, Spread spectrum multiple access, Space division multiple access, Packet radio, Orthogonal frequency division multiple access; Introduction to wireless systems and standards"
            },
            {
                "id":0,
                "title":"Books",
                "topics":"Wireless Communications: Principles and Practice by Theodore S. Rappaport, Pearson / PHI Publication_Wireless Communications and Networks: 3G and Beyond by Iti Saha Misra, Tata McGraw Hill Publication_Mobile Cellular Telecommunications: Analog and Digital Systems by William C. Y. Lee, Tata McGraw Hill Publication_Wireless Digital Communications by Kamilo Feher, PHI Publication "
            }
        ]
    },
    {
        "id": 30,
        "code": "ec-323",
        "title": "VLSI Design Techniques ",
        "credits": [4,3,1,0],
        "units": [
            {
                "id": 1,
                "title": "MOSFETS",
                "topics": "Fundamentals of Enhancement Mode MOSFETs, Depletion Mode MOSFETs, Weak & strong Inversion Conditions, Threshold Voltage Concept in MOSFETs, Current-Voltage (IV), Characteristics of a MOSFET, Limitations in IV Model and MOSFET parasitics, Trends & Projections in VLSI Design & Technology, Flow of VLSI Circuit Design, Scaling in MOS devices"
            },
            {
                "id": 2,
                "title": "VLSI Design Styles",
                "topics": "NMOS, CMOS Process flow, Noise Margin, Inverter Threshold Voltage, NMOS Inverter design and characteristics, CMOS Inverter Design and Properties, Delay and Power Dissipation, Parallel & Series Equivalent circuits, Static CMOS Circuit Design"
            },
            {
                "id": 3,
                "title": "VLSI Physical Design",
                "topics": "Stick Diagrams, Physical Design Rules, Layout Designing, Euler’s Rule for Physical Design, Reliability issues in CMOS VLSI, Latching"
            },
            {
                "id": 4,
                "title": "High Performance Logics",
                "topics": "Precharge-Evaluate logic, Dynamic CMOS logic, NORA logic, Complementary Pass Logic (CPL), Transmission gate logic"
            },
            {
                "id": 5,
                "title": "MOS Memory Design",
                "topics": "MOS memories: ROM design, SRAM Cell design and DRAMs"
            },
            {
                "id":6,
                "title": "CMOS Amplifiers",
                "topics": "Single stage MOS Amplifiers: Common Source amplifier, Common Gate amplifier, Common Drain amplifier "
            },
            {
                "id": 0,
                "title": "Books",
                "topics": "CMOS Digital Integrated Circuits-Analysis & Design by S.M. Kang and Y. Leblebici, TMH._Design of Analog CMOS Integrated Circuits by B. Razavi, TMH._Solid State Electronic Devices by B.G. Streetman and S. Banerjee, PHI._Principles of CMOS VLSI Design- A Systems Perspective by Neil H E Weste and K. Eshraghian. _Introduction to VLSI by K. Eshraghian and Pucknell, PHI"
            }
        ]
    },
    {
        "id": 31,
        "code": "ec-324",
        "title": "Antenna and Wave Propagation ",
        "credits": [4,3,1,0],
        "units": [
            {
                "id": 1,
                "title": "Electromagnetic radiation",
                "topics": "Radiation phenomenon from an oscillation dipole in free space, Induction and radiation fields, Retarded potentials, Radiated power and radiation resistance from a short dipole, Half wave dipole and quarter wave monopole"
            },
            {
                "id": 2,
                "title": "Antenna Fundamentals",
                "topics": "Directional properties of antennas, Radiation patterns, Antenna gain and aperture, Antenna terminal impedance, Self and mutual impedance, Front to back ratio, Antenna beam width and bandwidth, Antenna efficiency, Antenna beam area, Polarization, Antenna temperature and Reciprocity properties of antennas"
            },
            {
                "id": 3,
                "title": "Antenna Arrays",
                "topics": "Classification of arrays, Linear arrays of two point sources, Linear arrays of npoint sources, Pattern multiplication, Array factor, Linear arrays of equal amplitude and spacing (Broad side and end fire arrays) of n-point sources, Directivity and beam width, Non-uniform arrays excitation using Binomial series"
            },
            {
                "id": 4,
                "title": "Special Antennas",
                "topics": "VLF and LF antennas(Hertz and Marconi antennas), Rhombic antennas, Loop antennas ,Folded dipole antennas, Yagi-Uda antenna, Horn antennas, Microwave dish antennas, Helical antennas, Microstrip Patch antennas, Fractal antennas"
            },
            {
                "id": 5,
                "title": "Ground Wave Propagation",
                "topics": "Characteristics for ground wave propagation, Reflection at the surface of a finitely conducting plane and on earth, Attenuation Calculation of field strength at a distance"
            },
            {
                "id": 6,
                "title": "Ionosphere Propagation",
                "topics": "The ionosphere structure, Effective characteristics of the various layers of ionosphere, Reflection and Refraction of waves by ionosphere, Virtual height, Maximum usable frequency, Skip distance, Regular and irregular variation of ionosphere, Fading and Diversity reception. Space Wave Propagation: Space wave range, Troposphere waves-reflection, Refraction, Duct propagation, Troposphere propagation link"
            },
            {
                "id": 0,
                "title": "Books",
                "topics": "Antennas Theory by C.A. Balanis, Willey Publication._Antennas by J. D. Kraus, McGraw Hill._Antennas and Radio Propagation by R. E. Collins, McGraw-Hill._Electromagnetic waves & radiating System, E. C. Jorden and B. C. Balmann, P.H.I._Antenna & Wave Propagation, K. D. Prasad, Satya Prakashan New Delhi"
            }
        ]
    },
    {
        "id": 32,
        "code": "ec-325",
        "title": "Microprocessor and Microcontroller Lab",
        "credits": [1,0,0,2],
        "units": [
            {
                "id": 20,
                "title": "List of Experiments ",
                "topics": "On 8085 kit find the Factorial of a number._On 8085 kit, find if a number is prime or a perfect square._On 8051 kit write a program to perform serial data transfer._On 8051 kit generate square wave for a given frequency and duty cycle._On cortex M3 write a program to perform LED binking._On cortex M3 write a program to verify Digital out._On cortex M3 write a program to display clock on 7-segment display._On cortex M3 write a program to generate Analog output._On cortex M3 write a program to read in Analog input._On cortex M3 write a program to debug using serial pc._On cortex M3 write a program to generate PWM output._On cortex M3 write a program to perform counting on LCD counter._On cortex M3 write a program to learn Interrupt function._On cortex M3 write a program to understand 12c master and slave communication._On Intel Galileo Gen 2 plot a graph for analog input._On Intel Galileo Gen 2 write an Array in Arduino"
            }
        ]
    },
    {
        "id": 33,
        "code": "ec-326",
        "title": "VLSI Design Lab",
        "credits": [1,0,0,2],
        "units": [
            {
                "id": 20,
                "title": "List of Experiments ",
                "topics": "Familiarity with Tanner L-EDIT EDA Tools: To study the main features and utilities of the tools for design and physical design of circuits. Report the pros and cons of the tool._To find dc and transient response of a CMOS Inverter Circuit and its Physical Design using minimum dimension criteria. Hence extract various design parameters from simulation results. _To simulate transient response of CMOS NAND Gate (Fig.1). Physical Design the logic gate or design the layout, using minimum dimension criteria. _Simulate firstly minimum dimension CMOS inverter circuit using SPICE. Hence analyze and plot power and delay variations i) with voltage scaling, ii) For dimension, load and frequency variations._Simulate CMOS NAND, NOR and XOR circuits using SPICE. Hence analyze and plot their power and delay variations i)with voltage scaling,  ii)For dimension, load and frequency variations._Design a differential amplifier circuit for a voltage gain of 10. Design its layout._Physical Design of a complex circuit AOI/ OAI, making layout using Euler’s method, for delay, power and area centric designs. _Design a four input CMOS NAND and NOR gates with the constraint propagation delay not exceeding 10ns. Compare LVS._Familiarity with Cadence Familiarization with Cadence EDA Tools. To study the main features and utilities of the tools for design and physical layout design. Report the same in practical file._Design NAND NOR, XOR circuits using Cadence EDA Tools, for delay and power centric design criteria._Physical design a full adder circuit using minimum number of CMOS NAND gates._Design triangular wave generator using OP-Amps in SPICE._Familiarization with COMSOL Multiphysics Tool and its applications for Design and study of 1D Heat Transfer with Radiation model"
            }
        ]
    },
    {
        "id": 34,
        "code": "hs-404",
        "title": "Engineering Economics and Accountancy",
        "credits": [3,3,0,0],
        "units": [
            {
                "id": 1,
                "title": "Introduction to Engineering Economics",
                "topics": "Definitions, Nature, Scope and application; Difference between Micro Economics and Macro Economics; Theory of Demand & Supply: Meaning, Determinants, Law of Demand, Elasticity of demand, Demand Forecasting, Law of Supply, Equilibrium between Demand & Supply"
            },
            {
                "id": 2,
                "title": "Production and Cost",
                "topics": "Production functions, lsoquant, Least Cost combination, Laws of Returns to Scale. Economics and Diseconomies of Scale of production, Cost and Cost curves, Revenue and Revenue curve, Break even analysis"
            },
            {
                "id": 3,
                "title": "Costing and Appraisal",
                "topics": "Cost elements, Economic cost, Accounting cost, Standard cost, Actual cost, Overhead cost, Cost control, Criteria of project appraisal, Social cost benefit analysis "
            },
            {
                "id": 4,
                "title": "Markets",
                "topics": "Meaning, Types of Markets, Characteristics (Perfect Competition, Monopoly, Monopolistic Competition, Oligopoly) Price and Output Determination; Product Differentiation; Selling Costs; Excess Capacity"
            },
            {
                "id": 5,
                "title": "Money",
                "topics": "Meaning, Functions, Types; Monetary Policy- Meaning, Objectives, Tools; Fiscal Policy:-Meaning, Objectives, Tools.Banking: Meaning, Types, Functions, Central Bank: its Functions, concepts CRR, Bank Rate, Repo Rate, Reverse Repo Rate, SLR"
            },
            {
                "id": 6,
                "title" : "Depreciation",
                "topics": "Meaning of depreciation, causes, object of providing depreciation, factors affecting depreciation, Methods of Depreciation: Straight line method, Diminishing balance method, Annuity method and Sinking Fund method"
            },
            {
                "id": 7,
                "title" : "Financial Accounting",
                "topics": "Double entry system (concept only), Rules of Double entry system, Journal(Sub-division of Journal) , Ledger, Trial Balance  Preparation of final accounts-Trading Account. Profit and Loss account, Balance Sheet"
            },
            {
                "id": 0,
                "title": "Books",
                "topics": "Principles of Micro Economics by Mceachern & Kaur, Cengage Publication.  _Managerial Economics by Craig Peterson & W Cris Lewis, PHI Publication. _Modern Microeconomics by A. Koutsoyiannis, Macmillan. _Managerial Economics Theory and Applications by D. M. Mithani, Himalaya Publication House. _Fundamental of Managerial Economics by Mark Hirschey, South Western Educational Publishing. _Engineering Economics by Degramo, Prentice Hall._Financial Accounting–A Managerial Perspective by R. Narayanaswamy, PHI._Introduction to Accounting by J.R. Edwards and Marriot, Sage Publication._Cost Accounting by Jawahar Lal, Tata McGraw Hill._Project Planning Analysis, Selection, Implementation and Review by Prasanna Chandra, Tata McGraw Hill"
            }
        ]
    },
    {
        "id": 35,
        "code": "ec-421",
        "title": "Data Communication & Computer Networks ",
        "credits": [3,3,0,0],
        "units": [
            {
                "id": 1,
                "title": "Introduction to Data Communication",
                "topics": "Goals and Applications of Networks, Wireless Network, Interfaces and services. Reference Models: The OSI reference model, TCP/IP reference model"
            },
            {
                "id": 2,
                "title": "Physical Layer",
                "topics": "Analog and Digital, Analog Signals, Digital Signals, Analog versus Digital, Data Rate Limit, Transmission Impairments, Line Coding, Block Coding, Sampling, Transmission Mode, Modulation of Digital Data, Telephone Modems, Modulation of Analog Signal, FDM, WDM, TDM, Guided Media, Unguided Media, Switching"
            },
            {
                "id": 3,
                "title": "Data Link Layer",
                "topics": "Data Link Layer Design Issues, Services Provided to Network Layers, Framing, Error Control, Flow Control, Error Detection and Correction, Elementary Data Link Protocols, An Unrestricted Simplex Protocol, A Simplex Stop-and-Wait Protocol, Simplex Protocol for a Noisy Channel, Sliding Window Protocols, A protocol using go-back-N, A Protocol using Selective Repeat, Example Data Link Protocol-HDLC, PPP"
            },
            {
                "id": 4,
                "title": "Medium Access Sublayer",
                "topics": "Channel Allocations, Random Access, ALOHA, Carrier Sense Multiple Access Protocols, Collision Free Protocols, Limited Contention Protocols, Controlled Access, Channelization, Wired LANs: Ethernet, Wireless LANs"
            },
            {
                "id": 5,
                "title": "Network Layer",
                "topics": "Internetworks, Addressing, Routing, ARP, IP, ICMP, IPV6, Unicast Routing, Unicast Routing Protocol, Multicast Routing, Multicast Routing Protocols"
            },
            {
                "id": 6,
                "title": "Transport Layer",
                "topics": "Process to Process Delivery, User Datagram Protocol (UDP), Transmission Control Protocol (TCP), Data Traffic, Congestion, Congestion Control, Quality of Service, Techniques to Improve QOS, Integrated Services, QOS in Switched Networks "
            },
            {
                "id": 7,
                "title": "Application  Layer",
                "topics": "Design Issues of the Layer, Domain Name Systems, File Transfer, http, Web Documents, Virtual Terminals"
            },
            {
                "id": 0,
                "title": "Books",
                "topics": "Data Communications and Networking by Behrouz A Ferouzan, TATA McGraw Hill._Data and Computer Communication by Stallings William, Pearson Education._An Engineering Approach on Computer Networking by S. Keshav, Addison Welsey._Introduction to Data Communications and Networking by Wayne Tomasi, Pearson._Computer Networks by A.S. Tanenbaum, PHI"
            }
        ]
    },
    {
        "id": 36,
        "code": "hs-203",
        "title": "Organizational Behaviour",
        "credits": [3,3,0,0],
        "units": [
            {
                "id": 1,
                "title": "Organizational Behavior (OB)",
                "topics": "Concept, nature, characteristics, conceptual foundations, determinants and importance, management functions, role & skills, disciplines that contribute to the field of OB, Challenges & Opportunities for OB, diversity in Organizations, attitudes & Job satisfaction"
            },
            {
                "id": 2,
                "title": "Perception",
                "topics": "Concept, nature, process, importance, management and behavioral applications of perception. Personality: concept, nature, types and theories of personality shaping. Learning; concept and theories of learning"
            },
            {
                "id": 3,
                "title": "Motivation",
                "topics": "concept, principles, theories-content, process & contemporary, Monetary and nonmonetary motivation, applications of motivation. Leadership: Concept, functions, styles, and theories of leadership- trait, behavioral, and situational"
            },
            {
                "id": 4,
                "title": "Group and Interpersonal Relationship",
                "topics": "Analysis of Interpersonal Relationship, developing interpersonal relationship, Group Dynamic: Definition of Group, stages of Group Development, Punctuated Equilibrium Model, Group Structure, Group Decision Making, understanding work teams"
            },
            {
                "id": 5,
                "title": "Organizational Power and Politics",
                "topics": "concept of power, structure of power, classification of power, contrasting leadership & power, dependence a key to power, causes & consequences of political behavior. Organizational conflict: view of conflict, conflict process, negotiation & bargaining strategies"
            },
            {
                "id": 6,
                "title": "Conflict and Negotiation",
                "topics": "conflict definition in conflict thought: Traditional view, the Human relation view, interactionist view. Functional versus dysfunctional conflict, conflict process. Negotiation Bargaining strategies, the negotiation process and issues in negotiation"
            },
            {
                "id": 0,
                "title": "Books",
                "topics": "Robbins, S.P., Organizational Behavior, Prentice Hall of India._Luthans F., Organizational Behavior, McGraw-Hill._Davis K., Human Behavior at Work: Organizational Behavior, Tata McGraw-Hill"
            }
        ]
    },
    {
        "id": 37,
        "code": "cs-201",
        "title": "Data Structures",
        "credits": [4,3,1,0],
        "units": [
            {
                "id": 1,
                "title": "Introduction",
                "topics": "Data types, data structures, abstract data types, the running time of a program, the running time and storage cost of algorithms, complexity, asymptotic complexity, big O notation, obtaining the complexity of an algorithm"
            },
            {
                "id": 2,
                "title": "Development of Algorithms",
                "topics": "Notations and Analysis, Storage structures for arrays - sparse matrices - structures and arrays of structures, Stacks and Queues: Representations, implementations and applications.Linked Lists: Singly linked lists, Linked stacks and queues, operations on Polynomials, Doubly Linked Lists, Circularly Linked Lists, Operations on linked lists- Insertion, deletion and traversal, dynamic storage management – Garbage collection and compaction"
            },
            {
                "id": 3,
                "title": "Trees",
                "topics": "Basic terminology, General Trees, Binary Trees, Tree Traversing: in-order, pre-order and post-order traversal, building a binary search tree, Operations on Binary Trees - Expression Manipulations - Symbol Table construction, Height Balanced Trees(AVL), B-trees, B+-trees"
            },
            {
                "id": 4,
                "title": "Graphs",
                "topics": "Basic definitions, representations of directed and undirected graphs, the single-source shortest path problem, the all-pair shortest path problem, traversals of directed and undirected graphs, directed acyclic graphs, strong components, minimum cost spanning tress, articulation points and biconnected components, graph matching"
            },
            {
                "id": 5,
                "title": "Sorting and Searching Techniques",
                "topics": "Bubble sorting, Insertion sort, Selection sort, Shell sort, Merge sort, Heap and Heap sort, Quick sort, Radix sort and Bucket sort, Address calculation, Sequential searching, Binary Searching, Index searching, Hash table methods"
            },
            {
                "id": 0,
                "title": "Books",
                "topics": "An Introduction to Data Structures with applications by J.P. Tremblay and P.G. Sorenson, Tata McGraw Hill._Data structures, Algorithms ad Applications in C++ by Sartaj  Sahni, WCB/McGraw Hill._Data Structures and Algorithms by Alfred V. Aho, Jeffrey D. Ullman and  John E. Hopcroft, Addison Wesley._Data Structures using C by Y. Langsam, M. J. Augenstein and A. M. Tenenbaum, Pearson Education._Data Structures – A Pseudocode Approach with C by Richard F. Gilberg and Behrouz A. Forouzan, Thomson Brooks /Cole"
            }
        ]
    },
    {
        "id": 38,
        "code": "cs-221",
        "title": "Computer Organization and Architecture ",
        "credits": [4,3,1,0],
        "units": [
            {
                "id": 1,
                "title": "General System Architecture",
                "topics": "Stored  Program  control  concept  (Von-Newman  architecture principle),  Flynn‟s  Classification  of  computers (SIMD, MISD, MIMD), Structure organization (CPU, Caches, Main memory, Secondary memory unit & I/O), Register Transfer Operation, Micro-operation, Instruction Set Architecture (Instruction set based classification of processor i.e. RISC, CISC), Addressing Modes, Operation instruction set (Arithmetic & logical, Data transfer, Control flow), Instruction set format"
            },
            {
                "id": 2,
                "title": "Processor Design",
                "topics": "Arithmetic and logic unit, Stack organization, CPU Architecture types, Accumulator Based- Register, Stack-Memory, Register, Detailed data path of a typical register based CPU, Fetch, Decode, and Execute Cycle. Addition and Subtraction, Multiplication Algorithms (Booth’s Multiplication Algorithm), Division Algorithm, Floating point arithmetic operations"
            },
            {
                "id": 3,
                "title": "Control Design",
                "topics": "Microprogrammed and Hard-wired control options, Hard-wired design methods, State table method, Multiplier control, CPU control unit. Microprogrammed, Basic concepts, control Memory, Address Sequencing"
            },
            {
                "id": 4,
                "title": "I/O Organization & Memory Hierarchy",
                "topics": "Programmed, Interrupt driven & Direct Memory Access, Synchronous & synchronous data transfer, The need for Memory Hierarchy, locality of reference principle, Memory Hierarchy, cache, main and secondary, Memory parameters, access cycle time, cost per unit"
            },
            {
                "id": 5,
                "title": "Introduction to Parallelism",
                "topics": "Goals of parallelism, Instruction level parallelism, pipelining, superscaling, Processor level parallelism, Multiprocessor system overview"
            },
            {
                "id": 0,
                "title": "Books",
                "topics": "Computer Organization and Architecture, Designing for Performance by William Stallings, Pearson Education._Computer System Architecture by M. Morris Mano, Prentice Hall of India._Computer Architecture: A quantitative Approach by David A. Patterson and John. L. Hennessy,  Morgan Kaufmann._Structured Computer Organization by Andrew S. Tanenbaum and Todd Austin, Prentice Hall of India"
            }
        ]
    },
    {
        "id": 39,
        "code": "cs-222",
        "title": "Operating System",
        "credits": [4,3,1,0],
        "units": [
            {
                "id": 1,
                "title": "Evolution of Operating Systems",
                "topics": "Evolution of operating systems, Types of operating systems. The process concept, system programmer's view of processes, operating system's views of processes, operating system services for process management"
            },
            {
                "id": 2,
                "title": "CPU Scheduling",
                "topics": "Scheduling concepts, scheduling algorithms, algorithm evaluation, multiple processor scheduling, real time scheduling"
            },
            {
                "id": 3,
                "title": "Concurrent Programming and Deadlocks",
                "topics": "Critical regions, Conditional critical regions, Monitors, Interprocess communication, Messages, Pipes, Semaphores, Modularization, Synchronization, Concurrent languages. Deadlocks: Characterization, Prevention, Avoidance, Detection and Recovery, Combined approach to Deadlock Handling, precedence graphs"
            },
            {
                "id": 4,
                "title": "Memory Management",
                "topics": "Memory Management, Contiguous allocation, static-swapping, overlays, dynamic partitioned memory allocation, demand paging, page replacement, segmentation. Noncontiguous allocation, paging, Hardware support, Virtual Memory"
            },
            {
                "id": 5,
                "title": "File Systems",
                "topics": "A Simple file system, General model of a file system, Symbolic file system, Access control verification, Logical file system, Physical file system, Allocation strategy module, Device strategy module, I/O initiators, Device handlers, Disk scheduling"
            },
            {
                "id": 6,
                "title": "Networks, Security and Design Principles",
                "topics": "Network operating system, distributed operating system, external security, operational security, password protection, access control, security kernels, hardware security, layered approach, design principle"
            },
            {
                "id": 0,
                "title": "Books",
                "topics": "Operating System Concepts by J.L. Peterson and A. Silberchatz, Addison Wesley._An Introduction to Operating System by Harvey M. Dietel, Addison Wesley._Operating Systems - A Design Oriented Approach by C. Crowley, Irwin Publishing._Operating systems by W. Stallings, Prentice Hall._Modern Operating system by A.S. Tanenbaum, Prentice Hall of India"
            }
        ]
    },
    {
        "id": 40,
        "code": "cs-223",
        "title": "Theory of Computation ",
        "credits": [4,3,1,0],
        "units": [
            {
                "id": 1,
                "title": "Machines",
                "topics": "Basic machine, FSM, Transition graph, Transition matrix, Deterministic and nondeterministic FSMS, Equivalence of DFA and NDFA, Mealy and Moore machines, minimization of finite automata, Two-way finite automata"
            },
            {
                "id": 2,
                "title": "Regular Sets and Regular Grammars",
                "topics": "Alphabet, words, Operations, Regular sets, Finite automata and regular expression, Pumping lemma and regular sets, Application of pumping lemma, closure properties of regular sets"
            },
            {
                "id": 3,
                "title": "Formal Grammars and Languages",
                "topics": "Basic definitions and examples of languages, Chomsky hierarchy, Regular grammars, context free & context sensitive grammars, context free languages, non-context free languages, Chomsky normal forms, binary operations on languages. Simplification of CFG, Elimination of Useless symbols, Unit productions, Null productions, Greiback Normal form, Chomsky normal form – Problems related to CNF and GNF"
            },
            {
                "id": 4,
                "title": "Turing Machines and Pushdown Automata",
                "topics": "TM model, representation and languages acceptability of TM Design of TM, Universal TM and Other modification, composite and iterated TM, Pushdown automata, Acceptance by PDA"
            },
            {
                "id": 5,
                "title": "Computability",
                "topics": "Basic concepts, primitive and partial recursive function, Recursive function, Decidability, Kleene’s theorem. Undecidibility: Properties of recursive & recursively enumerable languages, Universal Turing machine and undecidable problem, Rice‟s theorem, undecidable problems"
            },
            {
                "id": 6,
                "title": "Computational Complexity Theory",
                "topics": "Definition, linear speed-up, tape compression & reduction in number of tapes, Hierarchy Theorem, Relation among complexity measures, Transition lemmas and  non-deterministic hierarchies, properties of general complexity measures, the gap, speed-up, union theorem, Automatic complexity theorem"
            },
            {
                "id": 0,
                "title": "Books",
                "topics": "Introduction to Automata theory, Languages and Computation by John E. Hopcroft and Jeffery Ullman, Narosa Publishers._Introductory Theory of Computer Science by E.V. Krishnamurthy, East West Press._Theory of computer Science by K.L.P. Mishra, Prentice Hall of India._An Introduction to Formal Languages and Automata by Peter Linz, Jones & Bartlett Learning._Introduction to Languages and the Theory of Computation by John C. Martin, Tata McGraw Hill"
            }
        ]
    },
    {
        "id": 41,
        "code": "cs-202",
        "title": "Data Structures Lab ",
        "credits": [1,0,0,2],
        "units": [
            {
                "id": 20,
                "title": "List of Experiments",
                "topics": "Write a program to sort an array (make a dynamic array) using Bubble sort. Use 1-bit variable FLAG to signal when no interchange take place during pass. If FLAG is 0 after any pass, then list is already sorted and there is no need to continue._Write a program to search an ITEM (integer) in an array using binary search, if FOUND then delete that item from array and if NOT FOUND than insert that item in kth position (Input “k” from user)._Write a program to enter records of Five students, which should contain fields like roll No., name, CGPI, semester. (a) List all record of all students having CGPI greater than k. (b) Insert a new record of student at kth position and print the final record._Implement linked list and insert and delete an element into the list._Evaluate a postfix algebraic expression with the help of stack._Implement a queue using arrays and linked list._Implement a binary tree and implement any traversal technique as you like._Implement a binary Search Tree and insert and delete a node in the BST._Implement Max Priority queue using Max Heap. _Implement a graph and find transpose of a graph where Transpose of a directed graph G is another directed graph on the same set of vertices with all of the edges reversed compared to the orientation of the corresponding edges in G. That is, if G contains an edge (u, v) then the converse/transpose/reverse of G contains an edge (v, u) and vice versa. Implement it with the help of adjacency list and adjacency matrix. _Implement Quick Sort, Merge Sort, Insertion Sort and Selection Sort"
            }
        ]
    },
    {
        "id": 42,
        "code": "cs-224",
        "title": "Computer Organization and Architecture Lab ",
        "credits": [1,0,0,2],
        "units": [
            {
                "id": 20,
                "title": "List of Experiments ",
                "topics": "Using virtual lab,  implement  i)  Ripple Carry Adder, ii)     Carry-Look-Ahead Adder, iii)     Wallace Tree Adder.._Using virtual lab, implement  i)  Synthesis of Flip Flops, ii)   Registers and Counters. _Using virtual lab implement i) Combinational Multipliers, ii)    Booth's Multiplier._Using  logisim  simulator design  i) 8 bit   Arithmetic Logic Unit, ii) 16 bit Arithmetic Unit._Simulate  Datapath for processor  using procsim simulator. _Design control path using Finite State Machine for CPU._Write a program to understand register and memory allocation in registers for MIPS architecture._Design Memory (Design of a RAM Cell and 4*4 RAM)._Write a program to find the factorial of a number in MIPS, C, FORTRAN and Python. Check the maximum data size for which factorial could be calculated. Find out how the overflow conditions are handled by different processors._Write a program to implement Karnaugh Map _Implement the cache memory  approaches  i) Associative cache Design, ii) Direct Mapped cache Design using ParaCache simulator"
            }
        ]
    },
    {
        "id": 43,
        "code": "cs-225",
        "title": "",
        "credits": [1,0,0,2],
        "units": [
            {
                "id": 1,
                "title": "List of Experiments",
                "topics": "Practice various commands/utilities in MS Windows and Linux OS for the following: • File management: create, copy, delete, link, display content, printing •Directory handling: create, delete, relocate, display content, sharing •Security features: setting/resetting file permissions to read, write, execute • Network configuration_Learn the top command to display resource utilization statistics of processes. _Simulate various CPU scheduling algorithms (FCFS, SJF-preemptive & no preemptive, Priority Scheduling-preemptive & no preemptive and Round Robin). Run your simulator for each scheduling policy, with a variety of quantum values. For each version of the simulator, for each input data file, for each quantum value, plot the completion time, throughput, average job elapsed time and average job waiting time. Analyze the behavior of your scheduler._Write a program to simulate Banker’s algorithm for deadlock handling._Simulate memory allocation algorithms (First Fit and Best Fit)._Simulate different page replacement strategies (FIFO, LRU and Optimal) and compare their performance._Using the fork(…) system call, write a program in which the parent creates a child and the child creates a grandchild. Synchronize the processes so that the grandchild first displays a message (and then terminates), the child displays a message (and then terminates), and finally the parent displays a message. _Simulate (at least three) disk scheduling protocols._Write a program to display the IP address and MAC address of a machine._Write script to implement background process that will continually print current time in upper right corner of the screen, while user can do his/her normal job at prompt._Write shell script to show various system configuration like • Currently logged user and his logname • Your current shell •Your home directory •Your current path setting •Your current working directory • Show Currently logged number of users • About your OS and version, release number, kernel version •Show all available shells • Show computer CPU information like processor type, speed, etc. •Show memory information •Show hard disk information like size of hard-disk, cache memory, model, etc. • File system (Mounted)_Installation and configuration of MS Windows and Linux OS"
            }
        ]
    },
    {
        "id": 44,
        "code": "ma-221",
        "title": "Linear Algebra & Applications",
        "credits": [4,3,1,0],
        "units": [
            {
                "id": 1,
                "title": "System of Linear Equations",
                "topics": "Matrices and elementary row operations, Row reduced echelon matrices, Homogeneous system of linear equations, Elementary matrices, LU Decomposition, Some applications giving rise to Linear Systems Problems"
            },
            {
                "id": 2,
                "title": "Vector Space",
                "topics": "Fields, fields of numbers, finite fields, Vector Spaces over R and C, subspaces, linear independence, basis and dimension of a vector space, ordered basis and co-ordinates, Application to difference equations and markov chains"
            },
            {
                "id": 3,
                "title": "Linear Transformation",
                "topics": "Linear transformations, Rank and Nullity of linear transformation, Algebra of linear transformation, Isomorphism, Invertible linear transformations, Dual and double dual of a vector space and transpose of a linear transformation, Matrix representation of Linear Transformation, eigenvalue and eigenvector of an linear transformation, Discrete dynamical systems, Application to differential equations"
            },
            {
                "id": 4,
                "title": "Eigen Decomposition",
                "topics": "Diagonalizability of linear operators of finite dimensional vector spaces, simultaneous triangulization and simultaneous diagonalization, Primary decomposition theorem - diagonal and nilpotent parts, Applications to Image processing and Statistics"
            },
            {
                "id": 5,
                "title": "Inner Product Spaces",
                "topics": "Gram-Schmidt orthogonalization, best approximation of a vector by a vector belonging a given subspace and application to least square problems, Adjoint of an operator, hermitian, unitary and normal operators, Singular Value Decomposition and its applications, Spectral decomposition, Applications of Inner product spaces"
            },
            {
                "id": 0,
                "title": "Books",
                "topics": "Linear algebra and it’s applications by G. Strang, Cengage._Linear Algebra and its Applications by D.C. Lay, Pearson._Linear Algebra by K. Hoffman and R. Kunze, Pearson._Linear Algebra: A Modern Introduction by D. Poole, Brooks/Cole._Linear Algebra: A Geometric Approach by S. Kumaresan, Prentice-Hall of India._Linear algebra (undergraduate text in mathematics) by S. Lang, Springer"
            }
        ]
    },
    {
        "id": 45,
        "code": "ma-222",
        "title": "Statistical Methods",
        "credits": [4,3,1,0],
        "units": [
            {
                "id": 1,
                "title": "Data Visualization",
                "topics": "Measures of central tendency, dispersion, skewness, kurtosis, data representation using Histogram, Pie Chart, Boxplot, Biplot, Multidimensional scaling"
            },
            {
                "id": 2,
                "title": "Order Statistics",
                "topics": "Different order statistics and their single and joint distribution, sampling distribution of mean, variance, random number generation, Generation of random numbers following certain distributions"
            },
            {
                "id": 3,
                "title": "Correlation and Regression",
                "topics": "Measures of relation between two variables – correlation and Rank correlation – Kendall’s Tau; Partial and Multiple correlation coefficients – Regression – Curve fitting by least squares – linear and quadratic"
            },
            {
                "id": 4,
                "title": "Hypothesis Testing",
                "topics": "Types of errors and power - most powerful tests, Test for equality of means and variances – t and F test; Chi-square test for goodness of fit and independence of attributes, Analysis of variance with one–way and two–way classifications"
            },
            {
                "id": 5,
                "title": "Multiple Comparison Tests",
                "topics": "Least Significant Difference, Student-Newman–Keuls test, Duncan’s Multiple Range test, Tukey’s test "
            },
            {
                "id": 0,
                "title": "Books",
                "topics": "Fundamentals of Mathematical Statistics by S. C. Gupta and V.K. Kapoor, Sultan Chand and Sons._Design and Analysis of Experiments by D.C. Montgomery, John Wiley and Sons._Fundamentals of Applied Statistics by S. C. Gupta and V.K. Kapoor, Sultan Chand._Statistical Inference – Testing of Hypotheses by M. K. Srivastava and N. Srivastava, Prentice Hall of India._An Introduction to Probability and Statistics by V.K. Rohatgi and A. K. Saleh, John Wiley and Sons._Applied Statistics and Probability for Engineers by D.C. Montgomery, G.C. Runger, John Wiley and Sons._Design and Analysis of Experiments by M.N. Das and N.C. Giri, Wiley Eastern Ltd"
            }
        ]
    },
    {
        "id": 46,
        "code": "ma-223",
        "title": "Data Structure ",
        "credits": [4,3,1,0],
        "units": [
            {
                "id": 1,
                "title": "Introduction",
                "topics": "Data types, data structures, abstract data types, the running time of a program, the running time and storage cost of algorithms, complexity, asymptotic complexity, big O notation, obtaining the complexity of an algorithm. Development of Algorithms: Notations and Analysis"
            },
            {
                "id": 2,
                "title": "Linear Data Structures and Linked Lists",
                "topics": "Storage structures for arrays - sparse matrices - structures and arrays of structures. Stacks and Queues: Representations, implementations and applications, Singly linked lists, Linked stacks and queues, operations on Polynomials, Doubly Linked Lists, Circularly Linked Lists, Operations on linked lists- Insertion, deletion and traversal, dynamic storage management – Garbage collection and compaction"
            },
            {
                "id": 3,
                "title": "Sorting and Searching Techniques",
                "topics": "Bubble sorting, Insertion sort, Selection sort, Shell sort, Merge sort, Heap and Heap sort, Quick sort, Radix sort and Bucket sort, Sequential searching, Binary Searching "
            },
            {
                "id": 4,
                "title": "Trees",
                "topics": "Basic terminology, General Trees, Binary Trees, Tree Traversing: in-order, pre-order and postorder traversal, building a binary search tree, Operations on Binary Trees - Expression Manipulations - Symbol Table construction, Height Balanced Trees(AVL), B-trees, B+ -trees"
            },
            {
                "id": 5,
                "title": "Graphs",
                "topics": "Basic definitions, representations of directed and undirected graphs, the single-source shortest path problem, the all-pair shortest path problem, traversals of directed and undirected graphs, directed acyclic graphs, strong components, minimum cost spanning tress, articulation points and biconnected components, graph matching"
            },
            {
                "id": 0,
                "title": "Books",
                "topics": "Introduction to Algorithms by T.H. Cormen, C. E. Leiserson, R. L. Rivest, C. Stein, MIT Press._An Introduction to Data Structures with applications by .J.P. Tremblay, P.G. Sorenson, Tata McGraw Hill._Data structures, Algorithms and Applications in C++ by by S. Sahni, Tata McGraw Hill._Data Structures using C by Y. Langsam, M. J. Augenstein, A. M. Tenenbaum, Pearson Education._Data Structures and Algorithmic Puzzles by N. Karumanchi, CareerMonk Publications._Data Structures and Algorithms by A.V.  Aho, J.D. Ullman, J.E. Hopcroft, Pearson._Data Structures – A Pseudo code Approach with C by R. F. Gilberg, B. A. Forouzan, Thomson Brooks / COLE"
            }
        ]
    },
    {
        "id": 47,
        "code": "ma-224",
        "title": "Operating System ",
        "credits": [4,3,1,0],
        "units": [
            {
                "id": 1,
                "title": "Evolution of Operating Systems",
                "topics": "Evolution of operating systems, Types of operating systems. The process concept, system programmer's view of processes, operating system's views of processes, operating system services for process management CPU Scheduling: Scheduling concepts, scheduling algorithms, algorithm evaluation, multiple processor scheduling, real time scheduling"
            },
            {
                "id": 2,
                "title": "Concurrent Programming and Deadlocks",
                "topics": "Critical regions, Conditional critical regions, Monitors, Interprocess communication, Messages, Pipes, Semaphores, Modularization, Synchronization, Concurrent languages. Deadlocks: Characterization, Prevention, Avoidance, Detection and Recovery, Combined approach to Deadlock Handling, precedence graphs"
            },
            {
                "id": 3,
                "title": "Memory Management",
                "topics": "Memory Management, Contiguous allocation, static-swapping, overlays, dynamic partitioned memory allocation, demand paging, page replacement, segmentation. Noncontiguous allocation, paging, Hardware support, Virtual Memory"
            },
            {
                "id": 4,
                "title": "File Systems",
                "topics": "A Simple file system, General model of a file system, Symbolic file system, Access control verification, Logical file system, Physical file system, Allocation strategy module, Device strategy module, I/O initiators, Device handlers, Disk scheduling"
            },
            {
                "id": 5,
                "title": "Networks, Security and Design Principles",
                "topics": "Network operating system, distributed operating system, external security, operational security, password protection, access control, security kernels, hardware security, layered approach, design principle"
            },
            {
                "id": 0,
                "title": "Books",
                "topics": "Operating System Concepts by J. L. Peterson and A. Silberchatz, Addison Wesley._An Introduction to Operating System by H. M. Dietel, Addison Wesley._Modern Operating system by A.S. Tanenbaum, Prentice Hall of India._Operating Systems - A Design Oriented Approach by C. Crowley, Irwin Publishing_Operating systems by W. Stallings, Prentice Hall of India._The design of the Unix operating systems by M.J. Back, Prentice Hall of India._Operating Systems Principles by Silberschatz, Galvin, Gagne, Wiley; Seventh edition"
            }
        ]
    },
    {
        "id": 48,
        "code": "ma-225",
        "title": "Data Structure Lab ",
        "credits": [1,0,0,2],
        "units": [
            {
                "id": 20,
                "title": "List of Experiments ",
                "topics": "Sorting Algorithms-Non-Recursive._Sorting Algorithms-Recursive._Searching Algorithm._Implementation of Stack using Array._Implementation of Queue using Array._Implementation of Circular Queue using Array._Implementation of Stack using Linked List._Implementation of Queue using Linked List._Implementation of Circular Queue using Linked List._Implementation of Tree Structures, Binary Tree, Tree Traversal, Binary Search Tree, Insertion and Deletion in BST._Graph Implementation, BFS, DFS, Minimum cost spanning tree, shortest path algorithm"
            }
        ]
    },
    {
        "id": 49,
        "code": "ma-226",
        "title": "Statistical Methods Lab ",
        "credits": [1,0,0,2],
        "units": [
            {
                "id": 20,
                "title": "List of Experiments ",
                "topics": "Introduction to SPSS and setting Up a Data File_SPSS Analysis: Windows Method versus Syntax Method and Missing data_Programs to Methods of MULT RESPONSE Procedures, Example of the Multiple-Dichotomy Method, Example of the MultipleResponse Method, Cross-Tabulations_Testing Statistical Significance between Two Correlation Coefficients Obtained from Two Samples_Spearman Rank Order Correlation Coefficient_Prediction Equation of Linear Regression and Multiple regression Analysis_Chi-Square Test for Single Variable Experiments and test of Independence between_t Test for Independent Groups _Paired-Samples t Test_Analysis of Variance – One-way and Two -way _Post Hoc Comparisons of ANOVA_Factorial Analysis of Variance "
            }
        ]
    },
    {
        "id": 50,
        "code": "ma-227",
        "title": "Operating System Lab",
        "credits": [1,0,0,2],
        "units": [
            {
                "id": 20,
                "title": "List of Experiments ",
                "topics": "Study of hardware and software requirements of different operating systems (UNIX,LINUX,WINDOWS XP, WINDOWS7/8_Execute various UNIX system calls for i. Process management  ii. File management  iii. Input/output Systems calls_Implement CPU Scheduling Policies: i. SJF ii Priority iii. FCFS  iv. Multi-level Queue_Implement file storage allocation technique: iContiguous(using array)  ii. Linked –list(using linked-list)  iii. Indirect allocation (indexing) Implementation of contiguous allocation techniques: i. Worst-Fit ii) Best- Fit iii)  First- Fit_Calculation of external and internal fragmentation i. Free space list of blocks from system  ii. List process file from the system_Implementation of compaction for the continually changing memory layout and calculate total movement of data  _Implementation of resource allocation graph RAG)_Implementation of Banker’s algorithm_Conversion of resource allocation graph (RAG) to wait for graph (WFG) for each type of method used for storing graph._Implement the solution for Bounded Buffer (producer-consumer)problem using inter process communication techniquesSemaphores_Implement the solutions for Readers-Writers problem using inter process communication technique –Semaphore "
            }
        ]
    },
    {
        "id": 51,
        "code": "ce-221",
        "title": "Indeterminate Structures",
        "credits": [4,3,1,0],
        "units": [
            {
                "id": 1,
                "title": "Introduction",
                "topics": "Static and kinematic indeterminacy"
            },
            {
                "id": 2,
                "title": "Statically indeterminate structures",
                "topics": "Force methods, Three-moment equation, Method of consistent deformation, Approximate method of analysis (Portal Frame, Cantilever, Substitute Frame Method)"
            },
            {
                "id": 3,
                "title": "Kinematically Indeterminate Structures",
                "topics": "Displacement Methods- slope deflection method, moment distribution method, Kani’s Method"
            },
            {
                "id": 4,
                "title": "Influence lines for In-determinate structures",
                "topics": "Muller-Breslau Principle for Influence lines diagram of indeterminate structures: Beams, frame, trusses and two hinged & fixed arches"
            },
            {
                "id": 0,
                "title": "Books",
                "topics": "Structural Analysis by R.C.Hibbeler,  Pearson._Fundamentals of Structural Analysis by K.M.Leet,C.MingUan, G &A.M.Gilbert,Tata McGraw Hill Education._Structural Analysis by DevdasMenon, Narsoa._Theory of Structures Vol-I&II by G.S.Pandit,S.P.Gupta&R.Gupta, Tata McGraw Hill Education._Structural Analysis by L.S.Negi&R.S.Jangid, TATA McGraw Hill education._Theory of Structures by S.Ramamrutham&R.Narayan, DhanpatRai& Son._Basic Structural Analysis by C.S.ReddyTATA McGraw Hill education._Theory of Structures by B.C.Punmia.Ashok Kumar Jain&Arun Kumar Jain, Laxm_Structural Analysis I&II by S.S.Bhavikatti,Vikas"
            }
        ]
    },
    {
        "id": 52,
        "code": "ce-222",
        "title": "Water Resources Engineering-I",
        "credits": [4,3,1,0],
        "units": [
            {
                "id": 1,
                "title": "Introduction",
                "topics": "Hydrological cycle, Water budget equation, Watershed"
            },
            {
                "id": 2,
                "title": "Abstractions",
                "topics": "Precipitation- Types, Measurement, Computation of average rainfall over a basin, Evaporation, transpiration, infiltration, Ф-index, weather systems"
            },
            {
                "id": 3,
                "title": "Runoff",
                "topics": "Factors affecting, runoff computation, rainfall-runoff correlation, flow mass curve, flow duration curve"
            },
            {
                "id": 4,
                "title": "Hydrographs",
                "topics": "Flood hydrograph, base flow separation, Unit and S  hydrograph, Unit Hydrograph from simple and complex storms, synthetic and instantaneous unit hydrograph"
            },
            {
                "id": 5,
                "title": "Floods",
                "topics": "Flood discharge estimation, flood control, reservoir and channel routing"
            },
            {
                "id": 6,
                "title": "Groundwater Hydrology",
                "topics": "Darcy’s Law – concept and applications, Well Hydraulics – Steady and unsteady state"
            },
            {
                "id": 0,
                "title": "Books",
                "topics": "Engineering Hydrology by K. Subramanya,_Engineering Hydrology by Ojha, Berndtssson and Bhunia,_Water Resources Engineering by R.K. Linsley and J.B. Franzini, McGraw-Hill Inc, 2000._S.K.Sharma by Design of Irrigation Structures,_Groundwater by H.M Raghunath_Grounwater Hydrology by B.R. Chahar"
            }
        ]
    },
    {
        "id": 53,
        "code": "ce-223",
        "title": "Soil Mechanics",
        "credits": [4,3,1,0],
        "units": [
            {
                "id": 1,
                "title": "Soil properties",
                "topics": "Soil mechanics, rock mechanics ,foundation engineering, soil formation, soil structure, soil map of India. Basic definitions phase diagram, water content, specific gravity, void ratio, porosity, unit weight, weight volume relationships, index properties of soil and their determination, classification of soils, degree of saturation, density index"
            },
            {
                "id": 2,
                "title": "Permeability, Seepage",
                "topics": "Darcy’s law and its validity, seepage velocity, discharge velocity, constant and variable head permea meter, pumping in & out tests, permeability of stratified soils, factors affecting permeability, laplace’s equation, flow potential flow net and its properties, different methods of drawing flownets, seepage pressure, quick sand, exit gradient, piping, design of filter, principle of total and effective stresses, capillarity conditions in soil, effective and pore pressures"
            },
            {
                "id": 3,
                "title": "Stress Distribution",
                "topics": "Effective and pore pressures,Effective stess principle.Stress distribution in soil, assumptions in elastic theories, Boussinesq’s equation for point, line, circular and rectangular loads, Westergaad’s formula for point load, comparison of Boussinesq’s and Westergaard’s equation, concept and use of pressure bulbs, principle and use of New mark’s influence chart, contact pressure"
            },
            {
                "id": 4,
                "title": "Compaction",
                "topics": "Mechanism of compaction, objective of compaction, measurement of compaction, factors affecting compaction, optimum moisture content, Standard Proctor test, Modified Proctor test, effect of moisture content and compactive effort on dry density, zero air void curve, compaction of cohesionless soils, field compaction, field control of compaction"
            },
            {
                "id": 5,
                "title": "Consolidation",
                "topics": "Mechanism of consolidation, e log)p) curves, basic definitions, estimation of pre consolidation pressure, normally consolidation and over consolidation ratio, Terzaghi’s theory of one dimensional consolidation, assumptions, governing equation, standard solution, laboratory determination of consolidation properties of soil, magnitude and rate of consolidation, settlements, secondary consolidation, compression characteristics of clays and settlement analysis"
            },
            {
                "id": 6,
                "title": "Shear strength",
                "topics": "Normal, shear and principal stresses, Columb’s equation, Mohr’s stress circle, Mohr Columb failure criteria, laboratory determination of shear parameters of soil by direct shear tests, triaxial test, unconfined compression test, Vane shear test, Consolidated drained, consolidated undrained and unconsolidated undrained shear test, pore pressure parameters, Lambe’s p q diagram"
            },
            {
                "id": 0,
                "title": "Books",
                "topics": "Soil Mechanics and Foundations by B.C. Punmia, Laxmi Publications, New Delhi._Geotechnical Engineering by C.Venkatramaiah, New Age International Publishers, New Delhi._Principles of soil mechanics Addison  Wesley by Ronald F. Scott, Massachusetts._Soil mechanics: Principles and Practice by Graham Barnes, Palgrave Macmillan, New York_Principles ofGeotechnical Engineering by Brij Mohan Das, CENGAGE Learning_Basic and applied soil mechanics by Gopal Ranjon & ASR Rao, New Age International Pvt Ltd Publishers_Modern Geotechnical Engineering by Alam"
            }
        ]
    },
    {
        "id": 54,
        "code": "ce-224",
        "title": "Building Materials and Construction ",
        "credits": [4,3,1,0],
        "units": [
            {
                "id": 1,
                "title": "Basic Structural Building Materials ",
                "topics": "Principle properties of Engineering materials: Physical & Mechanical, Clay product - Clay Brick and Tiles: Classification, tiles.  Limes: Classification and applications. Cement: Composition, types, manufacturing of Ordinary Portland Cement, rate of hydration, special types, Fine and Coarse aggregate: Source, Impurities, Classification, Characteristics. Timber: Classification, seasoning, defects, wood product and its applications"
            },
            {
                "id": 2,
                "title": "Transformed Material ",
                "topics": "Mortars: classification, characteristics, functions of ingredient, Cement concrete and Special concrete:  Types, physical properties "
            },
            {
                "id": 3,
                "title": "Service Material ",
                "topics": "Ceramic products: classification, refractories, glass, properties of ceramic materials. Ferrous and non-ferrous Metals and alloys: Properties, uses. Paints, Distemper & Varnishing: Basic constituents, types, composition, defects, application"
            },
            {
                "id": 4,
                "title": "Structural Components of building and building specification",
                "topics": "Foundation: Type, application, Masonry: Stone, Brick and Confined, Types, Bonds, defects. Walls: Design Consideration, constructional details, types of load bearing and non-load bearing walls, Floor and Roofs: type, Ground/Upper: Flat /Slopped.  Beam/Band-Plinth, Sill, Lintel -Types and details, Stairs, Ramps - classification, application. Form work: Requirements, Load applied, Scaffolding"
            },
            {
                "id": 5,
                "title": "Non Structural Components of building and building specification",
                "topics": "Plastering, Pointing: Type, methods, defects. Doors and Windows, Ventilators: Locations, sizes, types. Dampness and Water Proofing: Causes, Prevention Methods, damp-proofing treatment, Materials used"
            },
            {
                "id": 6,
                "title": "Building Service",
                "topics": "Plumbing- Fitting, Fixture, System, Termite Proof: Materials used and Method of application.  Fire Protection: Fire safety requirement, fire extinguishing equipment. Thermal Insulation: Basic definitions, Materials used, methods. Acoustics & Sound Insulation: characteristics, sound insulation, acoustical design. Ventilation: Functional requirement, Systems"
            },
            {
                "id": 0,
                "title": "Books",
                "topics": "Building Materials by S.K. Duggal, New Age Int. Publishers._Building Materials by P.C.Varghese, PHI_Engineering Materials by R.K. Rajput, S. Chand Publishers_Building Construction by B.C.Punmia Ashok Kumar Jain &Arun Kumar Jain, Laxmi Publication "
            }
        ]
    },
    {
        "id": 55,
        "code": "ce-225",
        "title": "Building Materials Lab",
        "credits": [1,0,0,2],
        "units": [
            {
                "id": 20,
                "title": "List of Experiments ",
                "topics": "Test For Cement : Finess of Cemen (Sieve Analysis, Air Permeability Test), Standard Consistency, Initial and Final Setting Time, Soundness, Compressive Strength, Specific Gravity. _Test for Fine Aggregate: Specific Gravity  (FA), Bulking of  Fine Aggregate, Fineness Modulus, gradation._Test for Course Aggregate: Specific Gravity and Water Absorption, Fineness Modulus and Gradation. _Test for Fresh &Hard Concrete: Workability Test  (Slump Test, Compaction Factor Test, Vee Bee Test), Cube and Cylinder Strength of Concrete, Flexural Tensile Strength._Test for Brick & Stone: Water Absorption/Efflorescence, Compressive Strength"
            }
        ]
    },
    {
        "id": 56,
        "code": "ce-226",
        "title": "Structural Lab ",
        "credits": [1,0,0,2],
        "units": [
            {
                "id": 20,
                "title": "List of Experiments ",
                "topics": "To verify the Betti’s Law& Maxwell law of reciprocal displacements._Study of a three hinged arch experimentally for a given set of loading and compare with analytical results._To obtain experimental influence line diagram for horizontal thrust in a three hinged arch and compare with theoretical value._To determine the flexural rigidity of a given beam._To study the behavior of different type of struts._To verify moment area theorem for slopes and deflections of a beam_To find the deflection of a pin-connected truss and to verify the results by calculation and graphically._To determine the carry over factors for beam with rigid connections._To determine the rotational stiffness of a beam when far end is (a) fixed (b) pinned._Determine experimentally the horizontal displacement of the roller end of a two hinged arch for a given set of loading and to compare the results with those obtained analytically._To obtain experimental influence line diagram for horizontal thrust in a two hinged arch and compare with theoretical value._To study tensile stress and strain on different materials "
            }
        ]
    },
    {
        "id": 57,
        "code": "ce-227",
        "title": "Building Construction Drawing",
        "credits": [1,0,0,2],
        "units": [
            {
                "id": 20,
                "title": "List of Drawing Sheet",
                "topics": "Conventional Representation– Drawing size, layout, title block, scales, lettering and dimensioning_Conventional Signs and symbols- Alphabetic, Sanitary, Plumbing, Drains and Pipes, Doors, windows_Masonry: Brick- Bonds- English, Flemish- 1/1.5  brick, stone-coursed random rubble, Ashlar, Brick Spread Foundations_Damp Proof Course: DPC in external/internal wall, basement, cavity wall  _Floors – Ground floor level with plinth beam / band, Upper Floor - RCC slab on wall, section through a wall_Arches and Lintel – Semicircular / Relieving arch, RCC lintel  _Doors and Windows – Aluminium/Steel paneled glazed door, Glazed window, steel, aluminium sectio_Stairs – Elevation/Plan – Dog legged _Plumbing– Single Stack/ two  pipe system  Sewerage – Manhole, Septic tank , seepage pit_Building Plan/ Elevation/section: Residential _Building Plan/ Elevation/section: Residential on Drafting software "
            }
        ]
    },
    {
        "id": 58,
        "code": "ma-321",
        "title": "Real & Complex Analysis",
        "credits": [4,3,1,0],
        "units": [
            {
                "id": 1,
                "title": "Riemann Integration",
                "topics": "Riemann Integration, Partition and Riemann sums, necessary and sufficient conditions for Riemann integrability of a function, first and second mean value theorems of integral calculus, fundamental theorem of integral calculus"
            },
            {
                "id": 2,
                "title": "Improper Integrals",
                "topics": "Improper integrals of first and second type, Beta function, Gamma function, their properties, relation between Beta and Gamma function, Convergence of improper integrals, comparison test, µ-test, Abel’s test, Dirichlet’s test"
            },
            {
                "id": 3,
                "title": "Metric Spaces",
                "topics": "Definition and examples, open, closed and bounded sets, Interior, closure and boundary, convergence and completeness, continuity and uniform continuity, connectedness, compactness and Seperability, Heine-Borel theorem"
            },
            {
                "id": 4,
                "title": "Preliminaries to Complex Analysis",
                "topics": "Basic properties: convergence, compactness, connectedness, Power series of complex valued function, radius of convergence"
            },
            {
                "id": 5,
                "title": "Complex Functions",
                "topics": "Poisson’s integral formula for a circle, Cauchy’s inequality, Fundamental theorem of integral calculus for complex valued function. Fundamental theorem of algebra, argument principle, Rouche’s theorem"
            },
            {
                "id": 0,
                "title": "Books",
                "topics": "Advanced Engineering Mathematics: by Erwin Kreyszig, John Wiley and Sons._Advanced Engineering Mathematics, R. K. Jain & S. R. K Iyengar, Narosa Pub. House._Complex Analysis for Mathematics and Engineering by J.H. Mathews and R.W. Howell, Narosa Publishing House._Complex Variables and Applications by J.W. Brown and R.V. Churchill, McGraw Hill._Mathematical Analysis by T. M. Apostol,, Addison-Wesley Publishing Company._Mathematical Analysis by S.C. Malik & Savita Arora,, New Age International (P) Ltd"
            }
        ]
    },
    {
        "id": 59,
        "code": "ma-322",
        "title": "Advanced Differential Equations and Applications",
        "credits": [4,3,1,0],
        "units": [
            {
                "id": 1,
                "title": "First Order Ordinary Differential Equations",
                "topics": "Revisiting basic concepts, Some models arising in ordinary differential equations, Existence and uniqueness of solution: Picard’s Theorem, Solutions to system of linear differential equations, eigenvalue-eigenvector method of finding solutions, Fundamental matrix, Nonhomogeneous equations"
            },
            {
                "id": 2,
                "title": "Second Order Ordinary Differential Equations",
                "topics": "Second order differential equations with constant and variable coefficients, Wronskian, reduction of order method of finding solutions,  Series solutions of ordinary differential equations, regular point and singular point, Frobenius method and some special functions"
            },
            {
                "id": 3,
                "title": "First Order Partial Differential Equations",
                "topics": "Well-posed problems and classical solutions, Transport equation, Pfaffian Differential equations, Cauchy's Problem for First -order Equations, Characteristics, Cauchy's Method of Characteristics, Compatible Systems of First -order Equations, Jacobi's Method"
            },
            {
                "id": 4,
                "title": "Second Order Linear Partial Differential Equations",
                "topics": "Second order partial differential equations in two variables and their classification, reduction of linear partial differential equation to canonical form; Cauchy, Dirichlet and Neumann problems; fundamental solutions of Laplace equations, Heat equation, Duhamel’s principle for inhomogeneous problems "
            },
            {
                "id": 5,
                "title": "Some Higher Dimensional Partial Differential Equations",
                "topics": "Solutions of Heat, Wave and Laplace equations in two or higher dimensions using Laplace and Fourier transforms"
            },
            {
                "id": 0,
                "title": "Books",
                "topics": "Differential Equations and their Applications by Martin Braun, Springer Verlag Berlin._Ordinary Differential Equations by B Rai and D P Choudhary and H I Freedman, Narosa Publication._Partial Differential Equations by L C Evans, American Mathematical Society._Elements of Partial Differential equations by I. N Seneddon, Dover Publications._Partial Differential Equations for Engineers and Scientists by J. N. Sharma and K. Singh,, Narosa  Publishing House"
            }
        ]
    },
    {
        "id": 60,
        "code": "ma-323",
        "title": "Time Series Analysis & Forecasting",
        "credits": [4,3,1,0],
        "units": [
            {
                "id": 1,
                "title": "Introduction",
                "topics": "Time-series as discrete parameter stochastic process, auto covariance and autocorrelation functions and their properties"
            },
            {
                "id": 2,
                "title": "Exploratory Time Series Analysis",
                "topics": "Components of time series, Messurements of trend, Measurement of seasonal fluctuation, Mesurement of cyclic movement, tests for trend and seasonality, exponential and moving average smoothing. Holt and Winters smoothing, forecasting based on smoothing"
            },
            {
                "id": 3,
                "title": "Models for Stationary Time Series",
                "topics": "(1) moving average (MA), (2) auto regressive (AR), (3) ARMA and (4) AR integrated MA (ARIMA) models. Box-Jenkins models, choice of AR and MA periods"
            },
            {
                "id": 4,
                "title": "Modeling Seasonal Time Series",
                "topics": "Seasonal ARIMA models, estimation and forecasting, Fitting ARIMA models with Box-Jenkins procedure, Identification, Estimation, Verification, Test for white noise, Forecasting with ARMA models. Spectral analysis: Spectral analysis of weakly stationary process, peridogram and correlogram analyses, computations based on Fourier transform"
            },
            {
                "id": 5,
                "title": "Multivariate Time Series",
                "topics": "Stationary multivariate time series, Cross-covariance and CrossCorrelation Matrices, Covariance Stationary, Vector white nose process, Moving average representation of a stationary vector process "
            },
            {
                "id": 0,
                "title": "Books",
                "topics": "Time Series Analysis: Forecasting and Control by G. Box and Jenkins, Palgrave Macmillan._Introduction to Time Series and Forecasting by P.J. Brockwell and R.A. Davis, Springer._Time Series Analysis by J. D. Hamilton, Princeton University Press"
            }
        ]
    },
    {
        "id": 61,
        "code": "ma-324",
        "title": "Soft Computing",
        "credits": [3,3,0,0],
        "units": [
            {
                "id": 1,
                "title": "Introduction to Soft Computing",
                "topics": "Concept of computing systems, “Soft” computing versus “Hard” computing, Characteristics of Soft computing, Some applications of Soft computing techniques"
            },
            {
                "id": 2,
                "title": "Fuzzy Logic",
                "topics": "Introduction to Fuzzy Logic, Classical and Fuzzy Sets: Overview of Classical Sets, Membership Function, Fuzzy rule generation. Operations on Fuzzy Sets: Compliment, Intersections, Unions, Combinations of Operations, Aggregation Operations. Fuzzy Arithmetic, Fuzzy Logic: Classical Logic, Multivalued Logics, Fuzzy Propositions, Fuzzy Qualifiers, Linguistic Hedges, Fuzzy Inference, Defuzzification techniques, Fuzzy logic controller design, some applications of fuzzy logic"
            },
            {
                "id": 3,
                "title": "Genetic Algorithms",
                "topics": "Concept of “Genetics” and “Evolution” and it’s applications to probabilistic search techniques, Basic GA framework and different GA architectures, GA operators: Encoding, Crossover, Selection, Mutation etc., Single objective Optimization problem using GA"
            },
            {
                "id": 4,
                "title": "Artificial Neural Networks",
                "topics": "Overview of biological Neuro-system, Mathematical Models of Neurons, ANN architecture, Learning rules, Learning Paradigms-Supervised, Unsupervised and reinforcement Learning, ANN training Algorithms- Training rules, Delta, Back Propagation Algorithm, Multilayer Perceptron Model, Hopfield Networks, Associative Memories, Applications of Artificial Neural Networks"
            },
            {
                "id": 5,
                "title": "Neuro-fuzzy Modeling",
                "topics": "Introduction of Neuro-Fuzzy Systems: Architecture of Neuro Fuzzy Networks, Neuro-fuzzy inference system, Rule base structure identification, Neuro fuzzy controls, Application of Neuro-fuzzy hybrid systems"
            },
            {
                "id": 0,
                "title": "Books",
                "topics": "Principles of Soft Computing by S.N. Sivanandam, S. N. Deepa, John Wiley & Sons._Neural Networks and Learning Machines by S. Haykin, Prentice Hall of India._Genetic Algorithms in Search, Optimization and Machine Learning by D.E. Goldberg, Pearson._Fuzzy Logic with Engineering Applications by T.J. Ross, John Wiley & Sons._Foundations of Neural Networks, Fuzzy systems and Knowledge Engineering by N.K. Kasabov, MIT Press._An Introduction to Genetic Algorithms by M. Mitchell, MIT Press"
            }
        ]
    },
    {
        "id": 62,
        "code": "ma-325",
        "title": "Numerical Computation Lab ",
        "credits": [1,0,0,2],
        "units": [
            {
                "id": 20,
                "title": "List of Experiments",
                "topics": "To find the roots of non-linear equation using Bisection method_To find the roots of non-linear equation using Regular Falsi method_To find the roots of non-linear equation using Newton-Raphson method_To solve the system of linear equations using Gauss-Elimination method_To solve the system of linear equations using Jacobi iteration method_To solve the system of linear equations using Gauss-Seidal method_To Interpolate the dependent variable by Newton’s interpolation formulae_To Interpolate the dependent variable by Gauss interpolation formulae_To integrate numerically using Trapezoidal rule_To integrate numerically using Simpson’s rules_To integrate numerically using Romberg integration_To find numerical solution of ordinary differential equations by Euler’s method_To find numerical solution of ordinary differential equations by Runge- Kutta method_To find numerical solution of ordinary differential equations by Adam Bashforth predictor corrector method "
            }
        ]
    },
    {
        "id": 63,
        "code": "ma-326",
        "title": "Time Series Analysis Lab",
        "credits": [1,0,0,2],
        "units": [
            {
                "id": 20,
                "title": "List of Experiments",
                "topics": "Understanding Time Series Data: descriptive analysis, association techniques._Time Series Decompostion._Autocorreation Function (ACF) & Partial Autocorreation Function (ACF)._Tests for Trend and Seasonality._Exponential smoothing and forecasting based on smoothing._Moving average smoothing and forecasting._Holt and Winter’s Smooting and forecasting._Application of Moving Average (MA) Time Series Models to data._Application of  Autoregrssive (AR) Time Series Models to data._Application of Autoregrssive Moving Average (ARMA) and Autoregressive Integrated Moving Average Time Series Models to data._Application of Seasonal Autoregrssive Moving Average (SARMA) Time Series Models to data._Spectral Analysis of Time Series Data"
            }
        ]
    },
    {
        "id": 64,
        "code": "ce-321",
        "title": "Steel Structure",
        "credits": [4,3,1,0],
        "units": [
            {
                "id": 1,
                "title": "Design of connections in steel structures",
                "topics": "Bolted and welded connections, assumptions, Different types of joints, design of various types of bolted and welded connections subjected to direct loads and Eccentric Loads"
            },
            {
                "id": 2,
                "title": "Design of tension members",
                "topics": "Selection of section, I.S. specifications, design of axially loaded tension members, design of members for axial tension and bending, end connections, design of lug angles and tension splices"
            },
            {
                "id": 3,
                "title": "Design of compression members",
                "topics": "Theory of buckling, design of column, cross section (single and built up sections), design of angle struts, eccentrically loaded columns, column splices, lacings and battens"
            },
            {
                "id": 4,
                "title": "Design of beams",
                "topics": "Lateral stability, design of single and built up beams, plated beams and curtailment of flange plates"
            },
            {
                "id": 5,
                "title": "Design of column bases and column footings",
                "topics": "Slab base, gusseted base, and Grillage Foundation subjected to Axial& Eccentric Loads"
            },
            {
                "id": 6,
                "title": "Design of roof trusses",
                "topics": "Types of trusses, roofs and side coverage, types of loadings and load combinations, design of members and connections"
            },
            {
                "id": 7,
                "title": "Design of Plate Girder and Gantry Girder",
                "topics": "Design of section, stiffeners, splices, design of built up Gantry Girder "
            },
            {
                "id": 0,
                "title": "Books",
                "topics": "Design of Steel Structures by  Subramanian,N, Oxford University Press, New Delhi _Design of Steel Structures by Duggal , S.K., Tata Mcgraw Hill, New Delhi _Design of Steel Structures by Limit State  Method As Per Is 800  2007, Bhavikatti,S.S., I.K.InternationalPublishing House, New Delhi _Limit State Design in Structural Steel by M.R.Shiyekar, PHI _Design of Steel Structures by K.S.Sai Ram, Pearson. _IS 800-2007  General Construction in Steel-Code of Practice, BIS _IS 801-1995 Use of cold deformed light gauge steel structural members in general BC"
            }
        ]
    },
    {
        "id": 65,
        "code": "ce-322",
        "title": "Water Resources Engineering -II",
        "credits": [4,3,1,0],
        "units": [
            {
                "id": 1,
                "title": "Open Channel Flow",
                "topics": "Types of open channels, classification of flows, continuity equation, concept of specific energy, critical depth, Chezy’s and Mannings equation, roughness coefficients, equivalent roughness, Hydraulically efficient channel cross sections"
            },
            {
                "id": 2,
                "title": "Gradually Varied Flow",
                "topics": "Equations of GVF, Slope Profiles, Computations of GVF Profiles"
            },
            {
                "id": 3,
                "title": "Rapidly Varied Flow",
                "topics": "Hydraulic Jump – Concept and computations, Principles of energy dissipation, Jump as Energy dissipaters, tail water rating curve and jump height curves"
            },
            {
                "id": 4,
                "title": "Irrigation",
                "topics": "Water requirements of crops: Soil moisture and crop-water relations, Consumptive use of water, duty and delta, irrigation efficiencies, computation of channel and reservoir capacity based on crop water requirements, Irrigation methods, Irrigation scheduling"
            },
            {
                "id": 5,
                "title": "Canals",
                "topics": "Canal classification, Design of stable channels, regime theory and design of unlined canals. Water logging: causes, preventive and curative measures"
            },
            {
                "id": 6,
                "title": "Water Resources Management",
                "topics": "Water resources availability and demand; Water use sectors – Domestic, Industries and Agriculture; Sustainable water resources development; Integrated Water Resources Management (IWRM)"
            },
            {
                "id": 0,
                "title": "Books",
                "topics": "Engineering Hydrology by K. Subramanya._Engineering Hydrology by Ojha, Berndtssson and Bhunia._Fundamentals of Irrigation Engineering by Bharat Singh.  _Water Resources Engineering by R.K. Linsley and J.B. Franzini, McGraw-Hill._S.K.Sharma by Design of Irrigation Structures._Irrigation Engineering and Hydraulic Structures by S.K. Garg._Flow in open Channels by K. Subramanya._Open Channel Flow by K.G. Rangaraju"
            }
        ]
    },
    {
        "id": 66,
        "code": "ce-323",
        "title": "Railways and Airports",
        "credits": [4,3,1,0],
        "units": [
            {
                "id": 1,
                "title": "Planning of Railways",
                "topics": "Significance of Road, Rail, Air and Water transports Coordination of all modes to achieve sustainability, Route alignment surveys, Soil suitability analysis, Railway stations and yards, passenger amenities "
            },
            {
                "id": 2,
                "title": "Railway Design",
                "topics": "Elements of permanent way Rails, Sleepers, Ballast, rail fixtures and fastenings, Track Stress, coning of wheels, creep in rails, signaling and interlocking, Geometric design of railways, gradient, super elevation, Points and Crossings"
            },
            {
                "id": 3,
                "title": "Airport Planning",
                "topics": "Air transport characteristics-airport classification-air port planning: objectives, components, layout characteristics, criteria for airport site selection and ICAO stipulations, Typical airport layouts, Parking and circulation area, Airport Zones, Passenger Facilities and Services "
            },
            {
                "id": 4,
                "title": "Airport Design",
                "topics": "Runway Design: Orientation, Wind Rose Diagram, Runway length, Geometric design of runways, Configuration and Pavement Design Principles, Elements of Taxiway Design, Runway and Taxiway Markings and lighting"
            },
            {
                "id": 0,
                "title": "Books",
                "topics": "A Course in Railway Engineering by Saxena Subhash C and Satyapal Arora, Dhanpat Rai and Sons._Airport Planning and Design by Khanna S K, Arora M G and Jain S S, Nemchand and Brothers, Roorkee"
            }
        ]
    },
    {
        "id": 67,
        "code": "ce-324",
        "title": "Waste Water Treatment and Management",
        "credits": [3,3,0,0],
        "units": [
            {
                "id": 1,
                "title": "Wastewater Generation, Collection & Conveyance",
                "topics": "Wastewater Quantity - Classification of wastewater - Sewerage system for domestic wastewater and storm water - Collections, and appurtenances - Design and layout of sewerage systems - Maintenance of sewerage systems - Physical, Chemical & Biological characteristics and their significance"
            },
            {
                "id": 2,
                "title": "Primary Treatment of Wastewater",
                "topics": "Objectives of Wastewater treatment- Treatment methods: Unit Operations and Processes Design criteria -Design of primary treatment System"
            },
            {
                "id": 3,
                "title": "Secondary Treatment of Wastewater",
                "topics": "Concepts of Biological treatment and removal mechanism – Aerobic and Anaerobic systems - Design of suspended and attached growth processes – Introduction to extended aeration processes and waste stabilization pond - Design of anaerobic system"
            },
            {
                "id": 4,
                "title": "House Drainage & Environmental Sanitation",
                "topics": "General principles - House drainage system - traps and sanitary fitting - Low cost sanitation system"
            },
            {
                "id": 5,
                "title": "Wastewater Disposal",
                "topics": "Alternative disposal methods - Self purification of stream - Standards for disposal alternatives, natural purification of polluted streams"
            },
            {
                "id": 6,
                "title": "Sludge Handling",
                "topics": "Quantity and quality of sludge, Methods of sludge treatment: sludge digestion and drying beds – Disposal of sludges"
            },
            {
                "id": 0,
                "title": "Books",
                "topics": "Sewage Disposal & Air Pollution Engineering by S.K. Garg,Khanna Publishers._Wastewater Engineering by Metcalf & Eddy, McGraw Hill._Wastewater Treatment Plants by Syed R. Qasim, PHI._Wastewater Treatment Concepts & Design Approach by G.L. Karia and R.A. Christian, PHI_Manual for Sewage Treatment by Ministry of Urban Development, Govt of India"
            }
        ]
    },
    {
        "id": 68,
        "code": "ce-325",
        "title": "Environmental Engineering Lab ",
        "credits": [1,0,0,2],
        "units": [
            {
                "id": 20,
                "title": "List of Experiments",
                "topics": "To  find  the  test  and  odor  of  a  given  sample  of  water._To  find  the  turbidity,  colour, PH, and conductivity  of  a  given  sample  of  water._To  find  out  total  dissolved  solid,  settleable  solids  and  suspended  solids  of  the given sample._To  determine  the  carbonate,  bicarbonate,  and  hydroxide  alkalinity  of  a  sample._To  find  out  the  concentration  of  chlorides  in  the  given  sample  of  water._To  estimate  the  hardness  of  the  given  sample  of  water  by  standard  EDTA  method _To  find  the  optimum  amount  of  coagulant  required  to  treat  the  turbid  water  by Jar Test._To  determine  residual  chlorine  in  a  given  sample  of  water._To  find  the  quantity  of  dissolved  oxygen  (DO)  present  in  the  given  sample._To  determine  biochemical  oxygen  demand  (BOD) and Chemical  oxygen  demand  (COD) of  given  waste  water sample _To determine MPN of coliforms of the given sample. _To determine the metal & metalloids of the given sample"
            }
        ]
    },
    {
        "id": 69,
        "code": "ce-326",
        "title": "Structural Drawing",
        "credits": [1,0,0,2],
        "units": [
            {
                "id": 20,
                "title": "List of Experiments",
                "topics": "Reinforced concrete Structures: Beam, column, beam-column junction, slab, foundation detail. _Retaining wall:  Counterfort retaining wall. _Water tanks drawing: R.C.C. rectangular, overhead water tank with staging. _Steel Structures: Typical connection details- welded and bolted, splice details, Lacing and battening, Column bases. _Roof trusses and connection details,  _Bridge Superstructure : T beam bridge, Hollow girder deck bridge _Bridges Substructure : Bridge Piers, Abutment, wing wall and approaches, well foundation "
            }
        ]
    },
    {
        "id": 70,
        "code": "cs-321",
        "title": "Distributed Systems",
        "credits": [4,3,1,0],
        "units": [
            {
                "id": 1,
                "title": "Introduction",
                "topics": "Characterization of Distributed System, Examples of distributed systems, Resource sharing and the World Wide Web, WWW 1.0, 2.0, 3.0, Challenges. System Models: Architectural models, S/w layers, system architecture and variants, Interface and Objects, Design requirements for distributed architectures, Fundamental Models: Interaction Model, Failure Model and Security Model"
            },
            {
                "id": 2,
                "title": "Interprocess Communication",
                "topics": "The API for the Internet protocols, characteristics of interprocess communication, Sockets, UDP Datagram communication, TCP stream communication, External data representation and marshalling, Client-server communication, Group communication, IP multicast, Network virtualization, Overlay networks"
            },
            {
                "id": 3,
                "title": "Distributed Objects and Remote Invocation",
                "topics": "Indirect Communication, Operating System Support, Distributed File Systems, File service architecture, Andrew File system. File System: Features-File model, File accessing models, File sharing semantics naming: Identifiers, Addresses, Name Resolution, Name Space Implementation, Name Caches, LDAP"
            },
            {
                "id": 4,
                "title": "Time and Global States",
                "topics": "Clocks, events and process states, Skew between computer clocks in a distributed system, Coordinated Universal Time (UTC),  physical time and clocks, Clock correctness, Cristian’s method for an asynchronous system, Berkeley algorithm, NTP,  logical time and clocks, vector clocks, global states, distributed garbage collection. Distributed Debugging, Global states and consistent cuts, Snapshot Algorithm"
            },
            {
                "id": 5,
                "title": "Coordination and Agreement",
                "topics": "Distributed mutual exclusion, elections, multicast communication, coordination agreement, consensus and related problems. Transactions and Concurrency Control, Transactions, Nested transactions, Locks, Optimistic concurrency control, Timestamp ordering, Atomic Commit protocols, Distributed deadlocks,  Replication"
            },
            {
                "id": 0,
                "title": "Books",
                "topics": "Distributed Systems: Concepts and Design by G. Coulouris, J. Dollimore, and T. Kindberg, Pearson Education._Distributed Systems: Principles and Paradigms by A.Tanenbaum and Maarten van Steen, Prentice Hall of India._Advanced Concepts in Operating Systems by M. Singhal and  N. Shivaratri, Tata McGraw Hill._Distributed Systems - An Algorithmic Approach by Sukumar Ghosh, Chapman and Hall/CRC._Distributed Algorithms: Principles, Algorithms, and Systems by D. Kshemkalyani and M. Singhal, Cambridge University Press"
            }
        ]
    },
    {
        "id": 71,
        "code": "cs-322",
        "title": "Software Engineering",
        "credits": [4,3,1,0],
        "units": [
            {
                "id": 1,
                "title": "Introduction",
                "topics": "Problem domain, software engineering challenges, software engineering approach. Software Processes: Software process, characteristics of software process, software development process models, other processes"
            },
            {
                "id": 2,
                "title": "Software Requirements Analysis and Specification",
                "topics": "Software requirements, problem analysis, requirements specification, functional specification with use cases, validation, matrices"
            },
            {
                "id": 3,
                "title": "Software Architecture",
                "topics": "Role of software architect, architecture views, component and connector view, architecture style for C & C view, discussion and evaluating architectures. Planning a software project: Effort estimation, project scheduling and staffing, software configuration management plan, quality assurance plan, risk management, project monitoring plan"
            },
            {
                "id": 4,
                "title": "Function Oriented Design",
                "topics": "Design principles, module level concepts, design notation and specification, structured design methodology, verification, metrics. Object oriented design: OO concepts, design concept, Unified Modeling Language, design methodology, metrics"
            },
            {
                "id": 5,
                "title": "Detailed Design, Software Measurements, Metrics and Models",
                "topics": "Detailed design and PDL, verification, Metrics and their scope, Qualities of a good Software metrics, classification of metrics, Cost estimation models COCOMO, Quality attributes, SQA, Quality Standards, ISO 9000 and CMM"
            },
            {
                "id": 6,
                "title": "Coding",
                "topics": "Programming principles and guidelines, coding process, refactoring, verification, metrics. Testing: Testing fundamentals, black-box testing, white-box testing, testing process, defect analysis and prevention, metrics - reliability estimation. CASE Tools: Types of CASE tools, advantages and components of CASE tools, Unified Modeling Language (UML)"
            },
            {
                "id": 7,
                "title": "IPR and Copyright",
                "topics": "Introduction and the need for intellectual property right (IPR), IPR in India – Genesis and Development, Patents: Searching, Drafting, Filling and Granting of Patents; Copyrights: Coverage and Need; Trademarks: Types, Rights, Kinds of signs of Trademarks; Geographical Indications"
            },
            {
                "id": 0,
                "title": "Books",
                "topics": "An Integrated Approach to Software Engineering by Pankaj Jalote, Narosa Publishing._Software Engineering: A Practitioner’s Approach by Roger. S. Pressman, Tata McGraw Hill._Fundamentals of Software Engineering by Rajib Mall, Prentice Hall of India. _UML Bible by Tom Pender, Wiley Dreamtech. _Software Engineering by Ian Sommerville, Addison-Wesley "
            }
        ]
    },
    {
        "id": 72,
        "code": "cs-323",
        "title": "Digital Image Processing ",
        "credits": [4,3,1,0],
        "units": [
            {
                "id": 1,
                "title": "Introduction",
                "topics": "Digital image representation, Fundamental steps in image processing, Elements of Digital Image processing systems, Elements of visual perception, Image model, Sampling and quantization, Relationship between pixels, Imaging geometry"
            },
            {
                "id": 2,
                "title": "Image Enhancement",
                "topics": "Enhancement by point processing, Intensity transformation, Histogram processing, Image subtraction, Image averaging, Spatial filtering, Smoothing filters, Sharpening filters, Frequency domain: Low-Pass, High-Pass, Homomorphic filtering"
            },
            {
                "id": 3,
                "title": "Image Segmentation",
                "topics": "Detection of discontinuities, Edge linking and boundary detection, Thresholding, Region oriented segmentation, Use of motion in segmentation, Spatial techniques, Frequency domain techniques"
            },
            {
                "id": 4,
                "title": "Image Restoration",
                "topics": "A model of the image degradation/restoration process, noise models, restoration in the presence of noise–only spatial filtering, Weiner filtering, constrained least squares filtering, geometric transforms; Introduction to the Fourier transform and the frequency domain, estimating the degradation function. Color Image Processing"
            },
            {
                "id": 5,
                "title": "Morphological Image Processing",
                "topics": "Preliminaries, dilation, erosion, open and closing, hit or miss transformation, basic morphological algorithms"
            },
            {
                "id": 6,
                "title": "Image Compression",
                "topics": "Coding redundancy, Inter-pixel redundancy, fidelity criteria, image compression models, error-free compression, lossy predictive coding, image compression standards"
            },
            {
                "id": 0,
                "title": "Books",
                "topics": "Digital Image Processing, by  R. Gonzalez and R. E. Wood, Prentice Hall of India._Digital Image Processing using MATLAB by R. Gonzalez, R. E. Wood and Steven L. Eddins Gatesmark Publishing._Introductory Computer Vision and Image Processing by   Andrian Low. McGraw Hill._Pattern Recognition-Statistical, Structural and neural approach by  Robert Schalkoff, John Willey & Sons._Fundamentals of Digital Image Processing by A K Jain, Prentice Hall"
            }
        ]
    },
    {
        "id": 73,
        "code": "cs-324",
        "title": "Computer Networks",
        "credits": [3,3,0,0],
        "units": [
            {
                "id": 1,
                "title": "Introductory Concepts",
                "topics": "Goals and Applications of Networks, LAN, WAN, MAN, Wireless network, Network software: Protocol hierarchies, design issues of layers, Interfaces and services. Reference Model: The OSI reference model, TCP/IP reference model, Example networks: Novell Netware, The ARPANET, The Internet, X-25 Networks, network standards"
            },
            {
                "id": 2,
                "title": "Physical Layer",
                "topics": "Fourier analysis, Maximum data rate of a channel, Transmission media, Wireless transmission, Narrowband ISDN, Broadband ISDN and ATM, Virtual circuits, Circuit switching, Communication satellite"
            },
            {
                "id": 3,
                "title": "Data Link Layer",
                "topics": "Data link layer design issues, services provided to network layers, Framing, Error control, Flow control, Error detection and correction, Elementary data link protocols, An unrestricted Simplex protocol, A Simplex Stop-and-Wait protocol, Simplex Protocol for a noisy channel, Sliding Window protocols, A one-bit Sliding protocol, A protocol using go-back-N, A protocol using selective repeat, Protocol specification and verification, Example data link protocol-HDLC, PPP and SLIP"
            },
            {
                "id": 4,
                "title": "Medium Access Sublayer",
                "topics": "Channel Allocations, Static and dynamic allocation in LAN and MAN, Multiple Access protocols, ALOHA, Carrier Sense multiple access protocols, WDMA protocols, Wireless protocols, Collision free protocols, Limited contention protocols, IEEE standard 802.3 and Ethernet, IEEE standard 802.4, Token bus IEEE standard 802.5, Token Ring, Distributed Queue Dual bus, Logical link control, bridges, High speed LAN, Satellite networks"
            },
            {
                "id": 5,
                "title": "Network Layer",
                "topics": "Network Layer design issue, Routing algorithms, Congestion Control Algorithms, Internetworking. Transport Layer: Transport services, Design issues, elements of transport protocols, simple transport protocols, Connection management, TCP, UDP"
            },
            {
                "id": 6,
                "title": "Session, Presentation and Application Layer",
                "topics": "Session Layer, Design issues, remote procedure call. Presentation Layer, Design issues, Data compression techniques, cryptography. Application Layer - File Transfer, Access and Management, Electronic mail, Virtual Terminals, Other applications, Example Networks - Internet and Public Networks"
            },
            {
                "id": 0,
                "title": "Books",
                "topics": "Computer Networks by A.S. Tanenbaum, Prentice Hall of India._Computer Networking: A Top-Down Approach Featuring the Internet by J. Kurose and K.W. Ross, Addison-Wesley._Data and Computer Communication by W. Stallings, Prentice Hall of India"
            }
        ]
    },
    {
        "id": 74,
        "code": "cs-325",
        "title": "Digital Image Processing Lab",
        "credits": [1,0,0,2],
        "units": [
            {
                "id": 20,
                "title": "List of Experiments",
                "topics": "Implement the spatial image enhancement functions on a bitmap image –Mirroring (Inversion) _Implement the spatial image enhancement functions on a bitmap image –Rotation (Clockwise) _Implement the spatial image enhancement functions on a bitmap image –Enlargement (Double Size) _Implement   i) Low Pass Filter, ii) High Pass Filter _Implement  i) Arithmetic Mean Filter, ii) Geometric Mean Filter_Implement Smoothing and Sharpening of an eight bit color image _Implement  i) Boundary Extraction Algorithm, ii) Graham's Scan Algorithm _Implement i)  Edge Detection, ii) Line Detection_Implement Image segmentation using OSTU and Thresholding Method_Implement data compression using JPEG algorithm"
            }
        ]
    },
    {
        "id": 75,
        "code": "cs-325",
        "title": "Computer Networks Lab",
        "credits": [1,0,0,2],
        "units": [
            {
                "id": 20,
                "title": "List of Experiments",
                "topics": "To become familiar with networking accessories and facilities in the Department of Computer Science and Engineering: Find out what networking devices are installed in the department; Describe the network type and topology of the department; File and printer sharing in different OSs; Network address configuration in different OSs; Finding IP and MAC address in different OSs; Workgroup and domain configuration; Use of utilities: arp, ipconfig/ifconfig, tracert, nslookup_Examine packets flow across a network segment and see the operation of various Internet protocols across the different layers in TCP/IP stack. (Hint: Use utilities netstat, snoop, tcpdump, …)_Use UNIX sockets to implement a simple client and server that communicate over the network. (Reference: Unix Network Programming by W. Richard Stevens, Prentice Hall)_Simulate various multiple access protocols (Aloha, slotted Aloha, p-persistent and non-persistent) and compare their performance at different loads._Write a program to display the IP address and MAC address of a machine._Implement ARP and RARP protocols for CSE LAN._Install Ethereal on a computer. Set Ethereal to capture with a filter option of your choice. Load a webpage or send an email to a friend and stop capturing. Analyze the packets. See if you can read any or all of the data transmitted. Write down your findings._Write a program to simulate routing using flooding. Each packet should contain a counter that is decremented on each hop. When the counter gets to zero, the packet is discarded. Time is discrete, with each line handling one packet per time interval. Make three versions of the program: all lines are flooded, all lines except the input line are flooded, and only the (statically chosen) best k lines are flooded. Compare flooding with deterministic routing (k = 1) in terms of both delay and the bandwidth used._Write a program that simulates a computer network using discrete time. The first packet on each router queue makes one hop per time interval. Each router has only a finite number of buffers. If a packet arrives and there is no room for it, it is discarded and not transmitted. Instead, there is an end-to-end protocol, complete with timeouts and acknowledgement a packet, which eventually regenerates the packet from the source router. Plot the throughput of the network as a function of the end-to-end timeout interval, parameterized by error rate._Design and implement a chat system that allows multiple groups of users to chat. A chat coordinator resides at a well-known network address, uses UDP for communication with chat clients, sets up chat servers for each chat session, and maintains a chat session directory. There is one chat server per chat session. A chat server uses TCP for communication with clients. A chat client allows users to start, join, and leave a chat session. Design and implement coordinator, server, and client code"
            }
        ]
    },
    {
        "id": 76,
        "code": "ee-221",
        "title": "Electrical Machines – I",
        "credits": [4,3,1,0],
        "units": [
            {
                "id": 1,
                "title": "Transformers",
                "topics": "Construction, Theory and operation, E.M.F. equation, phasor diagram, rating of transformers, equivalent circuit, open and short circuit tests, back to back test, voltage regulation and efficiency, auto-transformers, three winding transformer, parallel operation of single phase and three phase transformers, three phase transformer connections, phasor groups, three phase to two phase and six phase conversion, Harmonics and excitation phenomenon, inrush current phenomenon"
            },
            {
                "id": 2,
                "title": "Basic Concepts of Rotating Electrical Machines",
                "topics": "Constructional details of various rotating machines, Introduction to Lap and wave windings, EMF generation, Effect of chording and distribution of winding on EMF, Harmonics in generated emf, MMF produced by distributed winding"
            },
            {
                "id": 3,
                "title": "Energy Conversion",
                "topics": "Principle of electromechanical energy conversion, energy stored in a magnetic field system, singly and doubly excited systems"
            },
            {
                "id": 4,
                "title": "DC Machines",
                "topics": "Action of commutator, E.M.F. generated in armature, Torque in DC machines, Methods of excitation, armature reaction, MMF and flux density waveform of DC Machines, Commutation process, interpoles and compensating windings, Basic performance equations of DC machine, Magnetization and operating characteristics of DC generators and DC motors, DC motor starting and speed control, Ward Leonard system, losses and efficiency, applications of DC motors"
            },
            {
                "id": 0,
                "title": "Books",
                "topics": "Electrical Machinery by P.S. Bhimbra, Khanna Publishers, Delhi._Electrical Machinery Fundamentals by S. J. Chapman, McGraw Hill, New York._Electrical Machines by Ashfaq Hussian, Dhanpat Rai & Company"
            }
        ]
    },
    {
        "id": 77,
        "code": "ee-222",
        "title": "Microprocessor Architecture and Interfacing",
        "credits": [4,3,1,0],
        "units": [
            {
                "id": 1,
                "title": "Introduction to Microprocessors and Microcomputers",
                "topics": "Evolution of microprocessors, Architectural advancements of microprocessors, single-chip microcomputers, large and small computers, microprocessor applications "
            },
            {
                "id": 2,
                "title": "Microprocessor Architecture",
                "topics": "Intel 8085, ALU, timing & control unit, registers, opcode & operands, Instruction cycle: fetch operation; execute operation, machine cycle and state, instruction & data flow. Timing diagram: for op-code fetch cycle, memory read, I/O read, memory write & I/O write, Interrupts in 8085, RST instructions, multiple interrupts and priorities"
            },
            {
                "id": 3,
                "title": "Instruction Set and Programming",
                "topics": "Instruction and data formats, Addressing modes, status flags, Classification of instructions: Data transfer group, Arithmetic group, Logical group, Branch, Stack, I/O and Machine control group. Assembly language programs using 8085 instruction set, such as addition, subtraction, shift left, shift right, multiplication, division and involving loops, arrays, subroutines and stacks"
            },
            {
                "id": 4,
                "title": "Memory Interfacing",
                "topics": "Types of memory, ROM & its types, RAM & its types, address decoding, interfacing of memories"
            },
            {
                "id": 5,
                "title": "Peripheral Devices and Interfacing",
                "topics": "Data transfer schemes: synchronous data transfer, asynchronous data transfer, interrupt driven data transfer, DMA transfer,8257 DMA controller, programmable interrupt controller (PIC) Intel 8259, programmable peripheral interface (PPI) Intel 8255, programmable interval timer Intel 8253, programmable communication interface Intel 8251"
            },
            {
                "id": 6,
                "title": "Applications of 8085 Microprocessor",
                "topics": "Introduction, analog to digital Converter (ADC), Interfacing of ADC 0808/0809 and sample and hold to microprocessor 8085, display of decimal numbers and alphanumeric characters, Microprocessor based measurement of Electrical quantities- Frequency, phase angle and power factor, voltage, current. Interfacing of transducers to measure and display the non- electrical quantities such as temperature, water level and speed of motor etc"
            },
            {
                "id": 0,
                "title": "Books",
                "topics": "Microprocessor Architecture, Programming and Applications with the 8085 by R. S. Gaonkar, Penram International Publishing (India) Pvt Ltd._Introduction to Microprocessors by A. P. Mathur, TMH. _Fundamentals of Microprocessors and Microcomputers B. Ram, Dhanpat Rai & Sons. _Microprocessor Microcomputer and their Applications by A. K. Mukhopadhyay, Narosa Publishing House"
            }
        ]
    },
    {
        "id": 78,
        "code": "ee-223",
        "title": "Power Electronics",
        "credits": [4,3,1,0],
        "units": [
            {
                "id": 1,
                "title": "Characteristics of Various Solid State Devices ",
                "topics": "Semiconductor Power diodes, Power transistors, MOSFET, SCR Thyristor and its two transistor model, Triac, Gate turn off thyristor (GTO), Insulated gate bipolar transistor (IGBT), Comparison of switching power devices, Static Characteristics and Principles of operation, turn on and turn off characteristics, triggering circuits"
            },
            {
                "id": 2,
                "title": "AC to DC Converters ",
                "topics": "Line commutated thyristor based converters, phase controlled rectifiers, bridge converters - fully controlled, half controlled, uncontrolled  ( single phase and three phase  configuration), bidirectional  ac to dc voltage source converters, issues of line current harmonics, power factor, distortion factor and source inductance, Resonant Converters, inverter operation, applications in drives"
            },
            {
                "id": 3,
                "title": "DC to DC Converters ",
                "topics": "Thyristor choppers, voltage, current and  load commutation, step up and step down Choppers, basic principles of DC-DC switch mode Converters, buck, boost and buck-boost converters and applications "
            },
            {
                "id": 4,
                "title": "DC to AC Inverters ",
                "topics": "DC-AC switched mode converters, Voltage source inverters, single phase and three phase inverter, harmonic reduction techniques and Sinusoidal Pulse Width Modulation, current source inverter"
            },
            {
                "id": 5,
                "title": "AC to AC Converters ",
                "topics": "Single phase and 3-phase AC voltage controllers using thyristors , phase control and integral cycle control, AC choppers, single phase cyclo-converters, applications, effects of harmonics and electromagnetic interference, applications in drives "
            },
            {
                "id": 0,
                "title": "Books",
                "topics": "Modern Power Electronics by B.K.Bose, IEEE Press, New York._An Introduction to Thyristor and their applications by M.Ramamoorty, East West Press, New Delhi._Power Electronics by P.S.Bhimbra, Khanna Publishers, Delhi._Thyristorised Power Controllers by Dubey, Doradla, Joshi and Sinha, New age International Pub., New Delhi._Power Electronics-Circuits, Devices and Applications by M.H. Rashid, Pearson Education"
            }
        ]
    },
    {
        "id": 79,
        "code": "ee-224",
        "title": "Power System",
        "credits": [4,3,1,0],
        "units": [
            {
                "id": 1,
                "title": "Introduction to Power System, Load Characteristics and Economic Aspects",
                "topics": "Basic structure of power system, sources of electric energy: conventional and non-conventional; cogeneration, combined heat and power, captive power plants, distributed generation.  Commonly used terms and factors, curves useful in system operation and planning, economics of power factor improvement, interconnection of power stations and tariffs"
            },
            {
                "id": 2,
                "title": "Transmission Line Parameters",
                "topics": "Types of conductors, Ampere’s law, inductance of a conductor, inductance of a single phase line, inductance of a three-phase line, inductance of three-phase double circuit line, bundled conductors, skin effect , proximity effect, Guy’s theorem, Capacitance of single phase line, capacitance of a three-phase line, capacitance of  double circuit three phase line, effect of earth on capacitance"
            },
            {
                "id": 3,
                "title": "Transmission Line Performance ",
                "topics": "Classification of lines, models, circuit constants of transmission lines: short, medium and long lines; Ferranti effect, power flow through a line, sending and receiving end power circle diagram, reactive power generation/absorption of line, compensation and voltage control"
            },
            {
                "id": 4,
                "title": "Insulators for Overhead Transmission lines and Mechanical Design of Transmission line",
                "topics": "Types of insulators, ratings, voltage distribution across suspension insulators, string efficiency, methods to improve string efficiency.  Calculation of sag and tension, equivalent span length and sag, effect of ice and wind loading, stringing chart, sag template, conductor vibrations and vibration dampers"
            },
            {
                "id": 5,
                "title": "Corona and Radio interference",
                "topics": "Critical voltages, corona loss, advantages and disadvantages of corona, factors affecting corona loss, effect of corona on line design, radio interference"
            },
            {
                "id": 6,
                "title": "Distribution System and Insulated Cables",
                "topics": "Effect of voltage on transmission efficiency, Kelvin’s law, radial and ring main distributors, interconnectors, methods of feeding distributors, ac distribution, three-phase, four wire distribution system, stepped and tapered mains. Cable conductors, insulating materials, insulation resistance, electrostatic stress in cables, grading of cables, capacitance of a three-core cable, dielectric loss, dielectric power factor, classification of cables, cable performance"
            },
            {
                "id": 0,
                "title": "Books",
                "topics": "Electric Power systems by C.L. Wadhwa, New Age international, New Delhi._Electric Power generation transmission and distribution by S.N. Singh,  Prentice-hall of India, Private Limited, New Delhi._Elements of Power System Analysis by W.B. Stevenson McGraw Hill._Power System Engineering by D.P. Kothari and I.J. Nagrath, Tata McGraw Hill, New Delhi"
            }
        ]
    },
    {
        "id": 80,
        "code": "ee-225",
        "title": "Electrical Machines–I Lab",
        "credits": [1,0,0,2],
        "units": [
            {
                "id": 20,
                "title": "List of Experiments",
                "topics": "To  conduct open circuit  and short  circuit   test on a  single  phase transformer ._To conduct a polarity test on a single phase transformer._To study the constructional details and working of transformer._To perform back to back test on a single phase transformer._To perform parallel operation on a single phase transformer for the load sharing between them._To perform load test on a single phase transformer._To study the speed control of a D.C  shunt motor by field control method.   _To study the speed control of a D.C  shunt motor by armature control method._To study external load characteristic of D.C shunt generator._To conduct on experiment on a separately excited D.C generator and draw the magnetization characteristic and the  determine the critical field resistance and critical path"
            }
        ]
    },
    {
        "id": 81,
        "code": "ee-226",
        "title": "Power Electronics Lab",
        "credits": [1,0,0,2],
        "units": [
            {
                "id": 20,
                "title": "List of Experiments",
                "topics": "To determine the V-I characteristics of silicon controlled rectifier (SCR)._To study the output and transfer characteristics of MOSFET._To study output and transfer characteristics of IGBT._To determine the V-I characteristics of DIAC._To determine the V-I characteristics of TRIAC._To observe output waveform across RC load of a chopper which is a voltage commutated SCR._To study the action of voltage commutated chopper and plot output waveform._To study action of single phase half wave rectifier with resistive load._To study operation of single- phase full wave rectifier._To study the operation of single phase to single phase step down cyclo-converter "
            }
        ]
    },
    {
        "id": 82,
        "code": "ee-227",
        "title": "Microprocessor Architecture and Interfacing Lab",
        "credits": [1,0,0,2],
        "units": [
            {
                "id": 20,
                "title": "List of Experiments",
                "topics": "(i) Familiarization with 8085 microprocessor kit, hardware and software commands. (ii) Detailed description of commands: substitute, move, go to and search._To draw a flowchart and write a well-documented assembly language program (ALP) for addition of two 16bit hexadecimal numbers. Provision should exist for storing result and carry generated after addition._To draw a flow chart and write a well-documented assembly language program (alp) for subtraction of 16bit hexadecimal numbers and store the result at some memory location._To draw a flowchart and write an alp for the addition of ‘n’ number of data bytes stored in memory locations consecutively.  Save carry if any generated during addition.  Store the entire sum at two consecutive memory locations._To draw flow chart and write an alp for checking a hex number for odd or even parity, if the parity is odd, store 00 at some given memory location and if the parity is even, store ee at that location._To draw a flow chart and write program for multiplication of two 8-bit numbers by repetitive additions (provision for storing 16-bit result)._To draw a flow chart and write program for division of 16-bit number with an 8-bit number._To draw a flow chart and write program to arrange the given ‘n’ numbers stored in a block of memory locations   in (i) ascending order (ii) descending order._To write an assembly language program for finding the square of the number by lookup table technique. The values of the number whose squares to be found are given to be between the decimal number 1 to 9._To draw a flow chart and write program to find the largest number of the given numbers stored at consecutive memory locations.  Store the largest number at some memory location._To interface relay and opto-isolator with Microprocessor 8085._To interface ADC and DAC with Microprocessor 8085"
            }
        ]
    },
    {
        "id": 83,
        "code": "ee-321",
        "title": "Control Engineering",
        "credits": [4,3,1,0],
        "units": [
            {
                "id": 1,
                "title": "Introduction to Control system",
                "topics": "Historical overview, system, servo-mechanism, open loop and closed loop systems, mathematical modelling of physical systems, mechanical and electrical system analogy"
            },
            {
                "id": 2,
                "title": "Feedback and Non-Feedback Systems",
                "topics": "Block diagram representation and reduction techniques, Signal flow graphs, Mason Gain Formula, feedback and non-feedback systems, regenerative and degenerative feedback, effect of variation of system parameters on system performance, advantages of feedback, Control Components, general block diagram of a control system, a.c. and d.c. Servomotors, a.c. tachometer, synchro transmitter and receiver, synchro pair as control transformer, a.c and d.c position control system, stepper motor etc"
            },
            {
                "id": 3,
                "title": "Time Domain Analysis",
                "topics": "Introduction, standard input signals, Response of 1st and 2nd order systems, time domain specifications i.e. rise time, peak time, delay time, peak overshoot, settling time steady state error etc., different types of feedback systems, Steady state errors for unit step, unit ramp and unit parabolic inputs, Effect of addition of zero to the system"
            },
            {
                "id": 4,
                "title": "Stability Analysis",
                "topics": "Introduction, concept of stability, conditions for stable system, asymptotic, relative and marginal stability, Routh-Hurwitz criterion for stability, Root Locus Technique, concepts of root locus, construction of root loci, and various rules pertaining to locus diagram development "
            },
            {
                "id": 5,
                "title": "Frequency Domain Analysis",
                "topics": "Introduction, Relation between time and frequency response for 2nd order system, Bode plot, construction procedure for bode plot, gain cross over and phase cross over frequency, gain margin and phase margin, Nyquist plot & Nyquist stability criterion"
            },
            {
                "id": 6,
                "title": "Control System Design",
                "topics": "Selection and realization of basic compensators like lead, lag and laglead compensators etc., Introduction to PID Control"
            },
            {
                "id": 0,
                "title": "Books",
                "topics": "Control System Engineering by I.J. Nagrath and M. Gopal, Wiley Eastern._Modern Control Engineering by K. Ogata, Prentice Hall India._Control System Engineering by N.S. Nise, Wiley India (P) Limited._Automatic control Systems by B.C. Kuo, Prentice Hall India._Digital control and state variable methods by M. Gopal, Tata McGraw Hill"
            }
        ]
    },
    {
        "id": 84,
        "code": "ee-322",
        "title": "Power System Analysis",
        "credits": [4,3,1,0],
        "units": [
            {
                "id": 1,
                "title": "Introduction",
                "topics": "Nature and scope of power system studies, power system restructuring, power system computation and control, Smart grid concept"
            },
            {
                "id": 2,
                "title": "Power system Components modelling",
                "topics": "Mathematical model of transmission lines, tap changing transformer, generator and loads"
            },
            {
                "id": 3,
                "title": "Topological Analysis of Power Networks",
                "topics": "Primitive impedance and admittance matrices, system graph for transmission network, relevant concepts in graph theory, network representation, network matrices, network reduction"
            },
            {
                "id": 4,
                "title": "Bus Impedance Algorithm",
                "topics": "Partial network, addition of link(s), addition of branch(es), removal of elements, implementation of bus building algorithm, 3-phase Z-bus formation"
            },
            {
                "id": 5,
                "title": "Short Circuit Studies",
                "topics": "Types of faults, short circuit studies of large power system networks, calculating system conditions after the occurrence of fault, direct short circuit i.e. bolted faults. Comparison between symmetrical components and phase coordinate, method of short-circuit studies"
            },
            {
                "id": 6,
                "title": "Power Flow Studies",
                "topics": "Mathematical model of power flow studies, Solution techniques: GaussSeidel method, Newton-Raphson method, fast decoupled load flow method, comparison of solution technique"
            },
            {
                "id": 7,
                "title": "Stability Studies",
                "topics": "Types of stability, swing equation, point by point method, mathematical models for transient stability simulation, equal area criteria, direct numerical integration method"
            },
            {
                "id": 0,
                "title": "Books",
                "topics": "Computer Techniques in Power System Analysis by M.A. Pai, Tata McGraw Hill, New Delhi._Advanced Power System Analysis and Dynamics by L.P. Singh, New Age International_Modern Power System Analysis by DP Kothari and I.J. Nagrath, Tata McGraw Hill, New Delhi"
            }
        ]
    },
    {
        "id": 85,
        "code": "ee-323",
        "title": "Digital Signal Processing",
        "credits": [4,3,1,0],
        "units": [
            {
                "id": 1,
                "title": "Introduction",
                "topics": "Basic elements of digital signal processing, comparison of analog and digital signal processing, multi-channel and multi-dimensional signals, random and deterministic signals, FIR and IIR systems, recursive and non-recursive systems, correlation of discrete time signals"
            },
            {
                "id": 2,
                "title": "Discrete Fourier Transform and Fast Fourier Transform",
                "topics": "Frequency domain sampling and reconstruction of discrete time signals, DFT, DFT as linear transformation, frequency analysis of signals using DFT, properties of DFT, circular convolution, linear filtering methods based on DFT, overlap save and overlap add method, FFT algorithms, decimation in time and decimation in frequency algorithms, applications of FFT algorithms, linear filtering approach to computation of the DFT, Goertzel algorithm"
            },
            {
                "id": 3,
                "title": "Implementation of Discrete Time Systems",
                "topics": "Structures for the realization of LTI systems, recursive and non-recursive realization of FIR systems, structures for FIR systems, direct form, cascade form, frequency sampling and lattice structures, structures for IIR systems, direct form, signal flow graphs and transposed structure, cascade, parallel form and lattice structures"
            },
            {
                "id": 4,
                "title": "Design of FIR Digital Filters",
                "topics": "Introduction, LTI systems as frequency selective filters, Paley-Wiener theorem, characteristics of frequency selective filters, design of linear phase FIR filters, design of digital filters by placement of poles and zeros in z-plane, digital resonators, Notch filters, Comb filters and all pass filters, design of linear phase FIR filters using windows and by frequency sampling method"
            },
            {
                "id": 5,
                "title": "Design of IIR Digital Filters",
                "topics": "Introduction, design of IIR filters from their analog counterparts, design using approximation of derivatives, impulse invariance, bilinear transformation and matched z-transformation, frequency transformations in analog and digital domains, design of digital filters based on least squares method, design of IIR filters in frequency domain"
            },
            {
                "id": 0,
                "title": "Books",
                "topics": "Digital Signal Processing by J.G. Proakis and D.G. Manolakis, Pearson Education Publisher._Digital Signal Processing by A.V. Oppenheim and R.W. Schafer, Prentice Hall Publisher._Digital Signal and Image Processing by Tamal Bose, John Wiley and Sons Publisher._Digital Signal Processing by Sanjit K. Mitra, Tata McGraw Hill Publisher._A Course in Digital Signal Processing by Boaz Porat"
            }
        ]
    },
    {
        "id": 86,
        "code": "ee-324",
        "title": "Electric Drives",
        "credits": [3,3,0,0],
        "units": [
            {
                "id": 1,
                "title": "Introduction",
                "topics": "Electric drive system-Introduction, advantages, parts, classification, requirements and choice criteria, Dynamic equations of an electric drive, torque equations, multi-quadrant operation, types of loads, energy loss during transients and load equalization"
            },
            {
                "id": 2,
                "title": "Selection of Motor Drive Rating",
                "topics": "Selection of motor rating – thermal model of motor, classes of duty and determination of motor rating for different classes of drive operation duty"
            },
            {
                "id": 3,
                "title": "DC Motor Drives",
                "topics": "Starting, braking, speed control using single-phase and three-phase half and fully controlled rectifiers, chopper fed DC drives"
            },
            {
                "id": 4,
                "title": "Induction Motor Drives",
                "topics": "Starting and braking methods, speed control of SCIM using ac voltage controllers, VSI and CSI, v/f control, speed control of wound-rotor IM using rotor-resistance variation, slip-power recovery scheme and cyclo converter fed induction motor drives"
            },
            {
                "id": 5,
                "title": "Synchronous Motor Drives",
                "topics": "VSI drive, brushless excitation, true synchronous and self-controlled operation, PMSM and BLDC motor drives, synchronous reluctance motor"
            },
            {
                "id": 0,
                "title": "Books",
                "topics": "Electric Motor Drives by R. Krishnan, PHI._Electric Drive by M. Chilikin, Medtech._Power Semiconductor Controlled Drives by G. K. Dubey, Prentice Hall._Power Semiconductor Drives by S. B. Dewan, G. R. Slemon, and A. Straughen, John Wiley"
            }
        ]
    },
    {
        "id": 87,
        "code": "ee-325",
        "title": "Control Engineering Lab",
        "credits": [1,0,0,2],
        "units": [
            {
                "id": 20,
                "title": "List of Experiments",
                "topics": "To study potentiometer based error detector and to draw its characteristics._To study speed control and reversal of stepper motor using microprocessor._To study synchro transmitter – receiver pair and its operation as an error detector._Study of two phase AC servo motor and draw its speed torque characteristics._To study voltage sensitive bridge and to analyze its sensitivity and linearity._To study D.C. position control system and to execute position control through continuous and step command._To design, implement and study the effects of different cascade compensation networks for a given system._To study the Digital control system and to implement digital PID control for a modeled process._To study relay as nonlinear element and effect of dead-zone and hysteresis on the controlled process._To study speed control of DC Servomotor using PID controller. _To study magnetic amplifier and to plot control current versus load current characteristics for series, parallel and selfsaturation mode configuration._To study and perform simple two step open loop control and proportional control on process control simulator kit"
            }
        ]
    },
    {
        "id": 88,
        "code": "ee-326",
        "title": "Power System Analysis Lab",
        "credits": [1,0,0,2],
        "units": [
            {
                "id": 20,
                "title": "List of Experiments",
                "topics": "To obtain the ABCD parameters of transmission line model._To measure the breakdown voltage of transformer oil._Determination of power angle characteristics of transmission line._To improve the voltage profile at a load bus using a shunt capacitor._To verify the Ferranti effect in transmission line._To determine the breakdown voltage of solid insulator._To draw the PV characteristics of a transmission Line._To draw the characteristics of a series compensated transmission line._To determine the earth resistance using megger._To study and compare the performance of a 230V, 500m long ring mains and radial distribution systems"
            }
        ]
    },
    {
        "id": 89,
        "code": "ee-325",
        "title": "",
        "credits": [1,0,0,2],
        "units": [
            {
                "id": 20,
                "title": "List of Experiments",
                "topics": ""
            }
        ]
    }
]